[
    {
        "unique_identifier": "18330001",
        "description": [
            {
                "field_data": "With any other namespace level authorization rule present, if there is an entity that comes under that namespace, then all the access policies at namespace level will supersede the individual policies of the entity. This way single set of rules will govern all the entities and an attacker can manipulate the access policies of all the entities at same time.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will remove all the additional authorization policies that are applied to the entities in the namespace, hence granular management of entities will be required.",
                "field_type": "impact"
            },
            {
                "field_data": "Event Hub is a scalable event processing service that captures and processes large volumes of events and data, with low latency and high reliability. An Event Hub namespace provides a unique scoping container, referenced by its fully qualified domain name, in which we can create one or more event hubs. Data sent to an event hub can be transformed and stored by using any real-time analytics provider. The clients using Event Hub namespace should not use a namespace level access policy that provides access to all entities (event hubs instance or a topic) inside the namespace, irrespective of their individual policy configuration. To align with the least privilege security model, the policies should be created at the entity level to provide access to only the specific entity. Thus, it is recommended that Event Hub clients should not use a namespace level access policy that provides access to all entities in a namespace.\n(Related policy: All authorization rules except RootManageSharedAccessKey should be removed from Event Hub namespace)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1087.004",
            "T1537",
            "T1134.001",
            "T1213",
            "T1565",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18330002",
        "description": [
            {
                "field_data": "With any other namespace level authorization rule present, if there is an entity that comes under that namespace, then all the access policies at namespace level will supersede the individual policies of the entity. This way single set of rules will govern all the entities and an attacker can manipulate the access policies of all the entities at same time.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will remove all the additional authorization policies that are applied to the entities in the namespace, hence granular management of entities will be required.",
                "field_type": "impact"
            },
            {
                "field_data": "Service Bus is a messaging service on cloud used to connect any applications, devices, and services running in the cloud to any other applications or services. As a result, it acts as a messaging backbone for applications available in the cloud or across any devices. A namespace provides a scoping container for addressing Service Bus resources within the application. The clients using Service Bus should not use a namespace level access policy that provides access to all entity (relay, queue, or topic) in a namespace. To align with the least privilege security model, the policies should be created at the queue level to provide access to only the specific entity. Thus, it is recommended that Service Bus clients should not use a namespace level access policy that provides access to all entities in a namespace.\n(Related policy: All authorization rules except RootManageSharedAccessKey should be removed from Service Bus namespace)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1087.004",
            "T1537",
            "T1134.001",
            "T1213",
            "T1565",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18330003",
        "description": [
            {
                "field_data": "Without adhering to the principle of least privilege for authorization rules, if any of the SAS (shared access signature) policy is compromised, it would increase the risk of an attacker to gain access to the Event Hub entity and its data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control ensures that the authorization rules follow least privilege principle, which may require assigning granular permission to the entities which must be done with caution as it might affect the current access to the entities.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Event Hubs is a big data streaming platform and event capturing service. It can receive and process millions of events per second. Data sent to an event hub can be transformed and stored by using any real-time analytics provider. An event hub entity (event hubs instance or a topic) is governed by certain authorization rules (Shared Access Signature policies) that are used to manage access of data associated with the entity. The least privilege is the practice of restricting access rights for users, accounts, and computing processes to only those resources absolutely required to perform routine, legitimate activities. Hence, the authorization rules must be set as per the principle of least privilege.\n(Related policy: Authorization rules on the Event Hub entity should be defined)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1087.004",
            "T1537",
            "T1134.001",
            "T1213",
            "T1565",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18330004",
        "description": [
            {
                "field_data": "Without encrypting the Automation account variables, the data types and values contained by those variables will be accessible to any logged in user, which may have been intended only to the runbook to which it is shared, hence compromising the confidentiality of the variable's data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control ensures that all the variables are encrypted which will require all the unencrypted variables to be deleted and created again. Also once created, encrypted variables' value will not be visible while editing.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Automation is a service in Azure that allows you to automate your Azure management tasks and to orchestrate actions across external systems from right within Azure. Automation accounts are like Azure Storage accounts which serve as a container. The shared resources in Azure Automation allow for the reuse of variable assets, which provide a way to share values between multiple runbooks (powershell workflows) as well as between multiple jobs from the same runbook. Thus, to protect the confidentiality of the variables, it is recommended to enable encryption of Automation account variable assets when storing sensitive data.\n(Related policy: Encryption should be enabled on Automation account variables)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1565.001",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18330005",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Azure stream analytics, it will be difficult to troubleshoot any event that led to an unexpected failure or service outage, where the logs could have been helpful.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Azure Stream Analytics, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Stream Analytics is a real-time analytics and complex event-processing engine that is designed to analyze and process high volumes of fast streaming data from multiple sources simultaneously. Occasionally, an Azure Stream Analytics job unexpectedly stops processing because of failures caused by an unexpected query result, connectivity to devices, or an unexpected service outage. It's important to be able to troubleshoot this kind of event. The resource logs in Stream Analytics can help in identifying the cause of issues when they occur and reduce recovery time. Thus, it is recommended to enable logging for Stream Analytics as this will greatly help with debugging and monitoring.\n(Related policy: Diagnostic logs in Azure Stream Analytics should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330006",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Batch Accounts, it will be difficult to diagnose operational issues and failures, where the logs could have been helpful.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Batch Accounts, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Microsoft Azure Batch is a fully-managed cloud service that provides job scheduling and compute resource management for developers in organizations, independent software vendors, and cloud service providers. When a request is made against the Batch service, it authenticates it using the Azure Batch account name, the URL of the account, and either an access key or an Azure Active Directory token. Azure Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. The diagnostic logs associated with Batch accounts contain information emitted by Azure Batch service, that describe the operations for that resource. This data can be used in a variety of ways to monitor the Batch account and diagnose issues. Thus it is recommended to enable logging for Batch Accounts.\n(Related policy: Diagnostic logs in Batch accounts should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330007",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Event Hub, one will not be able to diagnose actions and operations responsible for any security incidents within Event Hub, which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Event Hub, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Event Hub is an event capturing service and a big data streaming platform. It is capable of processing millions of events per second and can easily connect millions of devices across platforms. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. Enabling these logs will help in capturing well-provided information about all the actions and operations that take place under the Event Hub. Thus, it is recommended to enable logging for Event Hub.\n(Related policy: Diagnostic logs in Event Hub should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330008",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Logic Apps, one will not be able to diagnose the runtime failures related to logic apps which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Logic Apps, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Logic Apps is a cloud service that helps you schedule, automate, and orchestrate tasks, business processes, and workflows when you need to integrate apps, data, systems, and services across enterprises or organizations. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. By enabling diagnostic logs one can record and store information about the runtime data and events of the Logic Apps. Thus, it is recommended to enable logging for Logic Apps.\n(Related policy: Diagnostic logs in Logic Apps should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330009",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Search Service, one will not be able to diagnose actions and operations responsible for any security incidents within Search Service, which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Search Services, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Search Service is a cloud search service that gives developers APIs and tools for building a rich search experience over private, heterogeneous content in web, mobile, and enterprise applications. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. These logs provides an insight into the detailed operations of Azure Search Service and are useful for monitoring service and workload processes.\n(Related policy: Diagnostic logs in Search services should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330010",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in service bus, one will not be able to diagnose actions and operations responsible for any security incidents within service bus, which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Service Bus, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Service Bus is a messaging service on cloud used to connect any applications, devices, and services running in the cloud to any other applications or services. It acts as a messaging backbone for applications available in the cloud or across any devices. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. Enabling logs in Service Bus helps to capture any operation such as queue or topic creation, resources used, and the status of the operation, that occur with a service bus namespace. Hence, it is recommended to enable diagnostic logs in service bus.\n(Related policy: Diagnostic logs in Service Bus should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18330011",
        "description": [
            {
                "field_data": "Without setting the ClusterProtectionLevel property of a service fabric cluster to 'Encrypt and Sign\", all the intra-cluster communication will be vulnerable to attacks such as eavesdropping, tampering, man-in-the-middle, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will set cluster protection level to 'EncryptAndSign', which will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "A Service Fabric cluster is a network-connected set of virtual or physical machines into which our microservices are deployed and managed. It provides three levels of protection (None, Sign, and EncryptAndSign) for node-to-node communication using a primary cluster certificate. With cluster protection level set to 'EncryptAndSign', all the node-to-node messages are encrypted and digitally signed. This protects the intra-cluster communication from eavesdropping/tampering/man-in-the-middle attacks on the network.\n(Related policy: The ClusterProtectionLevel property to EncryptAndSign in Service Fabric should be set)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18330012",
        "description": [
            {
                "field_data": "Without using Azure Active Directory for client authentication, the only other option is the use of a certificate for authentication, which makes the clusters insecure as it will be accessible by anyone over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control sets up Azure Active Directory for client authentication, however for internal employees if the cluster is configured in the Microsoft Tenant, then the user must have IT authorize a Security Group to the \"Admin\" role to be able to set it.",
                "field_type": "impact"
            },
            {
                "field_data": "A Service Fabric cluster is a network-connected set of virtual or physical machines into which our microservices are deployed and managed. It offers several entry points to its management functionality. The management of the Service Fabric cluster is performed via Service Fabric Explorer which supports both Certificate and Azure Active Directory authentication. The Azure Active Directory is Microsoft's enterprise cloud-based identity and access management (IAM) solution. Thus, it is recommended to secure access to management endpoints by setting up Azure Active Directory for client authentication. This will enable organizations (known as tenants) to manage user access to cluster.\n(Related policy: Service Fabric clusters should only use Azure Active Directory for client authentication)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18340001",
        "description": [
            {
                "field_data": "Without enabling logging for Key Vault, any unauthorized access to the private information (like credentials), encryption keys or certificates that are managed by the Key Vault service will not be monitored, as a result any intruder can get away with that information without leaving a trace.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables diagnostic logs for Key Vault which will incur additional charges incase the logs are being sent to the storage accounts. Also, there must be sufficient space available on the provided storage account for the logs.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Key Vault is a cloud service that provides a secure store for secrets. It safeguards the keys, secret information and certificates used by cloud apps and services. After the creation one or more key vaults, the access events of the key vault which includes how and when those key vaults are being accessed, and by whom might be helpful in analysing situations, like of a leak of secret information. Thus enabling logging for the Key Vault will log all the access activities which when retained for a specified time period will be usable for recreating activity trails for investigative purposes, when a security incident occurs or when the network is compromised.\n(Related policy: Diagnostic logs in Key Vault should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098",
            "T1098",
            "T1098",
            "T1098.004",
            "T1078",
            "T1078.001"
        ]
    },
    {
        "unique_identifier": "18340002",
        "description": [
            {
                "field_data": "In absence of Firewall and when the internet access to key vault is enabled, a user with right credentials will be able to access the secrets stored within the key vault from an untrusted network/system. This may expose the secret values in the hands of an unauthorized user.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If firewall is enabled for protecting Key Vault, then one must ensure that it is configured carefully so that it does not affect desired connections from trusted consumers. The access to the key vault would become restricted based on the configuration of the firewall.",
                "field_type": "impact"
            },
            {
                "field_data": "Key vault's firewall prevents unauthorized traffic from reaching your key vault and provides an additional layer of protection for your secrets. Enable the firewall to make sure that only traffic from allowed networks can access your key vault.\n(Related policy: Firewall should be enabled on Key Vault)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098.001",
            "T1087.004",
            "T1205",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18340004",
        "description": [
            {
                "field_data": "If purge protection is disabled on the key vault then a malicious insider in the organization will be able to permanently delete the key vault leaving it unrecoverable.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable purge protection on the key vault, which cannot be disabled later.",
                "field_type": "impact"
            },
            {
                "field_data": "Malicious or Unintended deletion of a key vault can lead to permanent data loss. A malicious insider in the organization can potentially delete and purge key vaults and its objects (secrets, keys, and certificates). Purge protection helps in enforcing a mandatory retention period and preventing the permanent deletion of key vaults or objects prior to the soft delete retention period elapsing. When purge protection is enabled, key vault and its objects cannot be purged by users or by Microsoft.\n(Related policy: Key vaults should have purge protection enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18340007",
        "description": [
            {
                "field_data": "If soft delete is disabled on the key vault then in case of an accidental deletion of a key vault, the data will not be recoverable and will get deleted permanently.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable soft delete on the key vault, but the name of the key vault that has been soft deleted cannot be reused until the retention period has passed.",
                "field_type": "impact"
            },
            {
                "field_data": "Enabling soft deletion ensures that even if the key vault is deleted, the key vault and its objects (secrets, keys, and certificates) remain recoverable for the specified number of days based on the retention period. In this span, the key vault and its objects can be recovered or purged (permanent deletion). Enabling purge protection ensures that the key vault and its objects cannot be purged during the 90 day retention period.\n(Related policy: Key vaults should have soft delete enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18340008",
        "description": [
            {
                "field_data": "If the private endpoint is not configured for the Key Vaults in Azure, then the unauthorized traffic from the public IP addresses will be able to access the Key Vault. This will expose the Key Vault to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate with Key Vault using the private endpoint, hence it must be ensured that all the Azure resources dependent on the Key Vault are configured to be able to access it through this private endpoint. Creating a new private endpoint would lead to additional costs.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity between the Key Vault and the resources in Azure. It is recommended to configure a private endpoint connection for Key Vault, to enable access to traffic coming only from known networks and prevent access from all other IP addresses (including the traffic from internet), thereby providing defense in depth protection against data exfiltration.\n(Related policy: Private endpoint should be configured for Key Vault)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18340009",
        "description": [
            {
                "field_data": "Ensure your certificates do not have a validity period that exceeds 12 months.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1555"
        ]
    },
    {
        "unique_identifier": "18350001",
        "description": [
            {
                "field_data": "Without defining authorized IP ranges on Kubernetes service, it will be publicly accessible through any IP, using which an attacker can gain access to cluster and make modifications to the container. Also, the unrestricted Kubernetes cluster will make it inherently susceptible to Man-in-the-middle attacks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remdiating this control sets authorized IP ranges on Kubernetes cluster, however if you are using Basic load balancer, you need to first migrate to Standard to use authorized IP ranges.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Kubernetes Service orchestrates clusters of virtual machines and schedules containers to run on those virtual machines based on their available compute resources and the resource requirements of each container. In Kubernetes, the API server receives requests to perform actions in the cluster such as to create resources or scale the number of nodes. Since the API server is the central way to interact with and manage a cluster, therefore we must improve the security of the cluster and minimize attacks, so that the API server is accessible only from limited set of IP address ranges.\n(Related policy: [Preview]: Authorized IP ranges should be defined on Kubernetes Services)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530"
        ]
    },
    {
        "unique_identifier": "18350003",
        "description": [
            {
                "field_data": "Without setting limits for CPU and memory, the container can be exploited through resource exhaustion attacks (a form of denial of service attack) where an attacker can waste the container resources through over usage.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will set a memory limit for containers, if a container exceeds the specified memory limit, it will be terminated and potentially restarted dependent upon the container restart policy.",
                "field_type": "impact"
            },
            {
                "field_data": "The Kubernetes clusters have containers with have certain resource usage limits that can be set. Enforcing CPU and memory limits prevents resource exhaustion attacks (a form of denial of service attack). Therefore we recommend setting limits for containers to ensure the runtime prevents the container from using more than the configured resource limit.\n(Related policy: Ensure container CPU and memory resource limits do not exceed the specified limits in Kubernetes cluster)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1200",
            "T1496"
        ]
    },
    {
        "unique_identifier": "18350004",
        "description": [
            {
                "field_data": "With deployment of a Kubernetes image from a non trusted registry, there is an increased risk of cluster exposure, as there can be presence of potential unknown vulnerabilities, security issues, and malicious images",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control makes sure that images ae being deployed from trusted registries, which will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Kubernetes does not offer native support for using secure image pull options. You will need to deploy a Kubernetes admission controller that can verify that the pods use trusted registries. The trusted registries reduce your cluster exposure risk by limiting the potential for the introduction of unknown vulnerabilities, security issues, and malicious images. Therefore, the images running on your Kubernetes cluster should come from known and monitored container image registries. \n(Related policy: Ensure only allowed container images in Kubernetes cluster)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1525",
            "T1543"
        ]
    },
    {
        "unique_identifier": "18350005",
        "description": [
            {
                "field_data": "With a container having privilege escalation, an attacker maybe able to exploit this configuration oversight in the container to gain elevated access to resources that are normally protected from an application or user.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control ensures no container has privilege escalation, which has no impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Privilege escalation techniques include enforcing policies on whether privileged containers are allowed to run; configuring Kubernetes Network Policies to segment and restrict traffic between, to, and from pods. Kubernetes cluster should not allow containers to run with privilege escalation to root, as it will allow an attacker to gain access to all the resources present on the host. This can be controlled using the AllowPrivilegeEscalation attribute.\n(Related policy: Kubernetes clusters should not allow container privilege escalation)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1547.006",
            "T1070"
        ]
    },
    {
        "unique_identifier": "18350006",
        "description": [
            {
                "field_data": "Without configuring the allowed ports on the containers, an attacker will easily be able to gain access to the Kubernetes cluster by performing attacks like brute force.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will configure the ports to which the container will listen, therefore the ports allowing or denying various set of IPs must be set cautiously, as it may affect the connections to those ports.",
                "field_type": "impact"
            },
            {
                "field_data": "The allowed ports on the containers should be restricted, as an attacker can use brute force techniques to gain access to Kubernetes cluster. These open ports will increase the attack surface of the Kubernetes cluster. Hence, it is recommended to restrict the access to the cluster by configuring the ports to which the containers listen to.\n(Related policy: Ensure containers listen only on allowed ports in Kubernetes cluster)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1095"
        ]
    },
    {
        "unique_identifier": "18350007",
        "description": [
            {
                "field_data": "Without enforcing immutable containers, any attacker can introduce undesired changes at runtime and add path finding malicious binaries, which may expose file informations like locations, types, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control sets the root file system to read only. This must be set with caution as  there maybe a requirement for the file system to have changes by users.",
                "field_type": "impact"
            },
            {
                "field_data": "Immutable filesystem protects containers from changes at run-time with malicious binaries being added to PATH. It is recommended to run containers with read-only privileges (immutable) on the root filesystem in the Kubernetes cluster, so that an attacker is not able to make modifications to the container.\n(Related policy: Kubernetes cluster containers should run with a read only root file system)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1525"
        ]
    },
    {
        "unique_identifier": "18350008",
        "description": [
            {
                "field_data": "Without adhering to the principle of least privilege for Linux capabilities, if any of the capability is compromised, it would increase the risk of an attacker gaining access to the container and its data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control ensures that the Linux capabilities follow least privilege principle, which may require assigning granular permission to the users which must be done with caution as it might affect their current access to the container.",
                "field_type": "impact"
            },
            {
                "field_data": "Linux Capabilities are used to allow binaries (executed by non-root users) to perform privileged operations without providing them all root permissions. They are used for the pod(set of running containers in the cluster) access underlying node processes. To reduce attack surface of your container, restrict Linux capabilities and grant specific privileges to containers without granting all the privileges of the root user. It is recommend to drop all capabilities and add only those that are required.\n(Related policy: Kubernetes cluster containers should only use allowed capabilities)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1565"
        ]
    },
    {
        "unique_identifier": "18350009",
        "description": [
            {
                "field_data": "Without restricting overriding or disabling of AppArmor profiles, any intruder can override or disable the AppArmor profiles that contain access rights to various applications and files within the container. This way they can access an application within the container without it's ownership.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will restrict the overriding and disabling of the containers AppArmor profiles, which will not have an impact.",
                "field_type": "impact"
            },
            {
                "field_data": "AppArmor (\"Application Armor\") is a Linux kernel security module that allows the system administrator to restrict programs' capabilities with per-program profiles. Profiles can allow capabilities like network access, raw socket access, and the permission to read, write, or execute files on matching paths. To use it, a system administrator associates an AppArmor security profile with each program. Thus, it is recommended that the overriding or disabling of containers AppArmor profile should be restricted.\n(Related policy: Kubernetes cluster containers should only use allowed AppArmor profiles)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1547.006"
        ]
    },
    {
        "unique_identifier": "18350010",
        "description": [
            {
                "field_data": "Without restricting the privileged containers, any attacker can use them as entry points for attacks, to spread malicious code or malware to compromised applications, hosts, and networks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control restricts the privileged containers. This must be done with caution if there are existing privileged containers which are business dependencies.",
                "field_type": "impact"
            },
            {
                "field_data": "Privileged containers have all of the root capabilities of a host machine. They can be used as entry points for attacks, and to spread malicious code or malware to compromised applications, hosts, and networks. Hence to prevent unrestricted host access, avoid privileged containers whenever possible.  \n(Related policy: Do not allow privileged containers in Kubernetes cluster)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1134.001",
            "T1213",
            "T1565",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18350012",
        "description": [
            {
                "field_data": "Without prohibiting the use of root user for running the containers, any attacker will easily be able to gain root privileges to the container and any misconfigurations will become easier to exploit.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will avoid the use of a  root user for running the containers which will not have any impact, but it will make debugging inside the containers a bit difficult as additional privileges will be required for running the commands inside the containers.",
                "field_type": "impact"
            },
            {
                "field_data": "Running a process as the root user inside a container runs it as root on the host. In case of compromise, an attacker has root in the container, and any misconfigurations become easier to exploit. Hence, it is recommended to run containers as a non-root user in the Kubernetes cluster.\n(Related policy: Kubernetes cluster pods and containers should only run with approved user and group IDs)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1563.001",
            "T1563.001"
        ]
    },
    {
        "unique_identifier": "18350013",
        "description": [
            {
                "field_data": "Without restricting access to the ports on the Kubernetes cluster, an attacker will easily be able to gain access to all the Kubernetes services by performing attacks like brute force.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control hardens the ports that are allowed in the Kubernetes cluster, therefore the ports allowing or denying various set of IPs must be set cautiously, as it may affect the connections to those ports.",
                "field_type": "impact"
            },
            {
                "field_data": "Only specific ports should be allowed in the Kubernetes cluster, so that an attacker is not able to brute-force and gain access to the cluster. To reduce the attack surface of your Kubernetes cluster, the access to them should be restricted by limiting services’ access to the configured ports.\n(Related policy: Ensure services listen only on allowed ports in Kubernetes cluster)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499"
        ]
    },
    {
        "unique_identifier": "18350014",
        "description": [
            {
                "field_data": "Without upgrading the Kubernetes service to the latest version, your clusters will be vulnerable to many exploitable security loop holes, which may have been fixed in the latest enhancements within Kubernetes. Also, plenty of bugs and issues that may have been patched will remain unfixed, thereby decreasing the user experience.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control upgrades the version of Kubernetes service, however after upgrading it to a newer version of Kubernetes, you cannot downgrade it back to an earlier version. Also, before you upgrade the version of Kubernetes running on the master nodes, the applications deployed on the cluster should be tested for compatiblilty with the new Kubernetes version.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Kubernetes Service orchestrates clusters of virtual machines and schedules containers to run on those virtual machines based on their available compute resources and the resource requirements of each container. It should be upgraded to the latest Kubernetes version in order to benefit from up-to-date vulnerability patches and capture the latest stable enhancements within Kubernetes. \nRelated policy: Kubernetes Services should be upgraded to a non-vulnerable Kubernetes version)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210"
        ]
    },
    {
        "unique_identifier": "18350015",
        "description": [
            {
                "field_data": "Without restricting the usage of host networking and ports, any attacker will be able to perform network sniffing from the shared network space. This way they will gain access to the data that is being passed in the network during communication.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control hardens the host network and port range in the Kubernetes cluster, therefore the range of ports must be set cautiously, as it may affect the connections to those ports.",
                "field_type": "impact"
            },
            {
                "field_data": "Pods created with the hostNetwork(Controls whether the pod may use the node network namespace) attribute enabled will share the node’s network space. To avoid compromised container from sniffing network traffic, we recommend not putting your pods on the host network. If you need to expose a container port on the node’s network, and using a Kubernetes Service node port does not meet your needs, then you can specify a hostPort(Provides a list of ranges of allowable ports in the host network namespace) for the container in the pod spec. It is recommended to restrict pod access to the host network and the allowable host port range in a Kubernetes cluster.\n(Related policy:  Kubernetes cluster pods should only use approved host network and port range)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499",
            "T1095"
        ]
    },
    {
        "unique_identifier": "18350016",
        "description": [
            {
                "field_data": "Without restricting the hostPaths to known lists, a container with unrestricted access to the host filesystem can escalate privileges in many ways, including reading data from other containers, and abusing the credentials of system services.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remedating this control restricts the hostPaths to only known paths, therefore the allowed list of host paths must be assigned with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "A hostPath volume mounts a file or directory from the host node's filesystem into your Pod. It specifies a list of host paths that are allowed to be used by hostPath volumes. An empty list means there is no restriction on host paths used. To reduce the attack surface of your Kubernetes cluster, the hostPath volume mounts in your Kubernetes cluster should be limited to the configured allowed host paths. Therefore the container node access from the containers should be restricted to only known list of host paths. \n(Related policy:  Kubernetes cluster pod hostPath volumes should only use allowed host paths)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1095"
        ]
    },
    {
        "unique_identifier": "18350026",
        "description": [
            {
                "field_data": "Protect your Kubernetes clusters and container workloads from potential threats by restricting deployment of container images with vulnerable software components. Use Defender for Cloud's CI/CD scanning and Microsoft Defender for container registries to identify and patch vulnerabilities prior to deployment. Evaluation prerequisite: Azure policy add-on/extension and the Defender profile/extension. Applicable only for private preview customers. Refer: https://aka.ms/AzureDefenderCICDscanning, https://aka.ms/AzureDefenderForContainerRegistries",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499"
        ]
    },
    {
        "unique_identifier": "18360001",
        "description": [
            {
                "field_data": "If the DDoS Protection Standard is not enabled for virtual networks, then any application that is moving to cloud and has public IP or any endpoint that is reachable over the internet will be vulnerable to DDoS attack. This attack can exhaust all the resources of an application and make it unavailable for a legitimate user.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If DDoS Protection Standard is enabled for virtual networks, then additional charges will be incurred. Also, in this case we will not be able to move that virtual network to another resource group or subscription. If we want to move the virtual network with DDoS Protection Standard enabled, we will have to first disable it, move the virtual network, and then enable the DDoS Protection Standard again.",
                "field_type": "impact"
            },
            {
                "field_data": "DDoS attacks are some of the largest availability and security concerns for the customers that are moving their applications to cloud. This kind of attack attempts to exhaust an application's resources, making the application unavailable to legitimate users. Therefore, while moving an application to cloud, security should be the major concern as DDoS attack can easily be targeted to all those endpoints that are reachable over internet. We should protect virtual networks containing applications with public IPs by enabling DDoS Protection Standard. DDoS protection also enables mitigation of network volumetric and protocol attacks.\nImportant: Remediating this recommendation will result in charges, as this service will offer enhanced DDoS mitigation capabilities via adaptive tuning, attack notification, and telemetry to protect against the impacts of a DDoS attack for all protected resources within this virtual network.\n(Related policy: Azure DDoS Protection Standard should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499.002",
            "T1499.002",
            "T1499.002",
            "T1499.002",
            "T1499.003",
            "T1499.003",
            "T1499.003",
            "T1499.003"
        ]
    },
    {
        "unique_identifier": "18360002",
        "description": [
            {
                "field_data": "If virtual networks are not protected by Azure firewall, then any attacker will be able to gain access to the resources and apps present in the virtual network from malicious IP addresses or domains without getting detected, as the alerts will not get generated by the firewall.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure firewall is used for protecting virtual network, then additional charges will be incurred. Also, firewall must be configured carefully so that it does not affect desired connections.",
                "field_type": "impact"
            },
            {
                "field_data": "An Azure firewall is a manageable cloud-based network security service that protects the Azure virtual network by logging the access to the apps and resources present in the virtual network. It's a fully stateful firewall as a service, with built-in high availability and unrestricted cloud scalability. We should use Azure firewall to restrict access to the virtual networks and prevent potential threats by generating alerts and denying traffic from/to known malicious IP addresses and domains.\nImportant: Azure firewall is billed separately from Azure Security Center.\n(Related policy: Virtual networks should be protected by Azure Firewall)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098.001",
            "T1087.004",
            "T1205",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18370001",
        "description": [
            {
                "field_data": "In absence of data classification, the sensitive data may get inadvertently copied to a setup with inadequate security controls which could thereby lead to data disclosure in the event of a breach. It could lead to regulatory fines as well as the loss of reputation.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will help in discovering, classifying and labelling the sensitive data, thus it must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure SQL database provides data discovery & classification capabilities for discovering, classifying, labeling, and protecting the sensitive data in the databases. Once the data is classified, Azure SQL database auditing can be used to audit access and monitor the sensitive data. Azure SQL database also enables Advanced Threat Protection features which creates intelligent alerts based on changes in the access patterns to the sensitive data.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18370003",
        "description": [
            {
                "field_data": "If auditing is not enabled for SQL servers then any activity being performed by an unauthorized user on the SQL server will go undetected, as no audit logs will be generated to re-trace the activity.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the audit logs are generated for the SQL server, but during very high activity, or high network load, SQL database in Azure will allow operations to proceed and may not record some audited events.",
                "field_type": "impact"
            },
            {
                "field_data": "Auditing for SQL servers in Azure helps in tracking the activities across all databases on the server and writing them to an audit log in the Azure storage account, Log Analytics workspace, or Event Hubs. This would help in maintaining the regulatory compliance and gaining insight into the discrepancies and anomalies that could indicate business concerns or suspected security violations.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.001"
        ]
    },
    {
        "unique_identifier": "18370004",
        "description": [
            {
                "field_data": "If the platform-managed key is used instead of a customer-managed key for encrypting the SQL server then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the platform-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the SQL servers in Azure, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the database inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure SQL Transparent Data Encryption (TDE) with customer-managed key enables Bring Your Own Key (BYOK) scenario for data protection at rest, and allows organizations to implement separation of duties in the management of keys and data. With customer-managed transparent data encryption the data is encrypted with a customer-managed asymmetric key (TDE protector) stored in the customer-owned Azure Key Vault. Also, the customer is responsible for and in a full control of the key lifecycle management (key creation, upload, rotation, deletion), key usage permissions, and auditing of operations on keys.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18370006",
        "description": [
            {
                "field_data": "The vulnerabilities reported during the vulnerability assessment by tools such as Azure Defender may lead to unauthorized access to data stored in the SQL database, which may thereby impact the confidentiality, integrity, or availability of the consumer application and the organization.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control removes reported vulnerabilities, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability scanner works by deploying various assessment extensions on the SQL databse, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings which includes any deviations from best practices such as misconfigurations, excessive permissions, and unprotected sensitive data to the Security Center. However, all the vulnerability findings must be remediated to get the full benefit of Vulnerability assessment solution to secure the SQL database.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18370007",
        "description": [
            {
                "field_data": "Without a vulnerability assessment solution installed, a number of open vulnerabilities like remote cloud execution (an action which involves an attacker executing code remotely using system vulnerabilities) can go undetected which can double up as openings for an attacker to gain access to the operations of a SQL server remotely and make breaking changes.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables a built-in vulnerability assessment solution and also provides other thrid party vulnerability assessment scanners, the usage of which may require licensing and incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability assessment scanner works by deploying various assessment extensions on the SQL server, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings to Security Center. Thereby, helping in the discovery, tracking and remediation of potential vulnerabilities. Hence, it is recommended to install a vulnerability assessment solution (included with Azure Defender) to enable a best of breed vulnerability assessment solution on the SQL server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190",
            "T1046",
            "T1210"
        ]
    },
    {
        "unique_identifier": "18370008",
        "description": [
            {
                "field_data": "If Azure Defender for SQL is not enabled on the SQL server then we will not be able to detect anomalous database access patterns and mitigate potential database vulnerabilities such as SQL injection, password bruteforce attacks, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for protecting SQL on the SQL server, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for SQL is a unified package that provides advanced SQL security capabilities.  It includes functionality for surfacing and mitigating potential database vulnerabilities, detecting anomalous activities that could indicate a threat to the database, and discovering and classifying sensitive data.\nImportant: Remediating this recommendation will result in charges for protecting the Azure SQL Database servers. If you don't have any Azure SQL Database servers in the subscription, no charges will be incurred. If you create any Azure SQL Database servers on this subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced data security should be enabled on your SQL servers)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499",
            "T1499.002",
            "T1499.003",
            "T1499.004"
        ]
    },
    {
        "unique_identifier": "18370010",
        "description": [
            {
                "field_data": "If public network access to Azure SQL Database is enabled, then the accessibility of the database will be increased thereby exposing it to attacks such as man-in-the-middle, credentials bruteforce, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Azure SQL Database. The only way to access the database will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Azure SQL Database should be disabled to ensure that the database is accessible only via the private endpoints. Disabling public access will decrease the accessibility of the database, and thereby enhance its security by making it inaccessible over the internet. Hence, as a best security practice, the public network access to the Azure SQL Database should be disabled.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18370011",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Azure SQL Database, then the only way to access the resources is through the public endpoint. This will expose the database to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the SQL server's private endpoint, hence it must be ensured that all the Azure resources dependent on the Azure SQL Database are configured to be able to access the database server through this private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity to Azure SQL Database. It is recommended to configure a private endpoint connection for Azure SQL Database, to enable access to traffic coming only from known networks and prevent access from all other IP addresses, including within Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18380001",
        "description": [
            {
                "field_data": "Without the adaptive hardening of NSG rules being used to secure network traffic for internet-facing virtual machines, an attacker might attempt to access the virtual machine through a subset of an unwanted traffic without being detected. Along with this, the virtual machine will also be susceptible to other network attacks like DDoS, Eavesdropping, Jamming, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will apply adaptive network hardening recommendations in addition to the NSG rules, which might further limit the allowed traffic against the requirement, thus it must be set cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "Adaptive Network Hardening is a feature found in the Azure Security Center. It provides recommendations using machine learning on the actual traffic and helps in hardening the Network Security Group (NSG) rules. Applying the NSG rule to filter traffic to and from resources, improves the network security posture, whereas, Adaptive Network Hardening feature enables Azure Security Center to learn the network traffic and connectivity patterns of the Azure workloads and provide us with NSG rule recommendations for the internet-facing virtual machines. This can help us to better configure the network access policies and limit the exposure to attacks, even when there are already filtering rules in place, as the filtering rules may be too permissive.\n(Related policy: Adaptive Network Hardening recommendations should be applied on internet facing virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1205.001",
            "T1046"
        ]
    },
    {
        "unique_identifier": "18380002",
        "description": [
            {
                "field_data": "With the network ports not restricted on the virtual machines, the open network ports become dangerous as legitimate services can be exploited by cybercriminals when security vulnerabilities or malicious services are introduced to a system via malware or social engineering, which can further be used in conjunction with open ports to gain unauthorized access to sensitive data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control sets the ports' allow access to other values than 'any' or 'internet', which may be required for some special service ports (like ports 22, 80, and 1443), in which case it should be set to either 'any' or 'internet'.",
                "field_type": "impact"
            },
            {
                "field_data": "Network Security Group (NSG) is used to filter network traffic to and from the Azure resources in an Azure virtual network, they act as a firewall to block unnecessary ports. Closing unused ports reduces your security risk by reducing the number of attack vectors your organization is exposed to. Therefore, Network Security Group's inbound rules should not be too permissive, i.e. it should not allow access from 'Any' or 'Internet' ranges, as it can potentially enable attackers to target the resources easily. \n(Related policy: Access through internet facing endpoint should be restricted)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499"
        ]
    },
    {
        "unique_identifier": "18380003",
        "description": [
            {
                "field_data": "If the Network Security Groups are not configured for internet facing virtual machines, then the accessibility of the machines will be increased, wherein the attacker will be able to attempt to gain access to the virtual machine making it susceptable to attacks such as DDoS, Eavesdropping, Jamming, Brute force, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will ensure that the traffic from internet is restricted from accessing the virtual machine, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "Internet facing virtual machines can be protected from potential threats by restricting access to it with a Network Security Group (NSG). NSGs contain a list of Access Control List (ACL) rules that allow or deny network traffic to the virtual machine from other instances, in or outside the same subnet. Virtual machines that are internet-facing have higher exposure to attacks, therefore the virtual machine access to the Internet must be restricted, and an NSG should be enabled on the subnet to keep them secured.\n(Related policy: Internet-facing virtual machines should be protected with Network Security Groups)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1046"
        ]
    },
    {
        "unique_identifier": "18380004",
        "description": [
            {
                "field_data": "If the Network Security Groups are not configured to protect the non internet facing virtual machines, the resources will be vulnerable from malicious users and attackers present in the network. For instance, if a non internet facing application is exposed to an internet facing subnet then it may provide a path to an attacker for accessing the machine.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will ensure that the traffic from a particular network or subnet is restricted from accessing the virtual machine, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "Non internet facing virtual machines can be protected from potential threats by restricting access to them with a Network Security Group (NSG). NSGs contain a list of Access Control List (ACL) rules that allow or deny network traffic to the virtual machine from other instances, whether or not they're on the same subnet. It is recommended to keep the virtual machine as much secure as possible, by enabling NSG on the virtual network or subnet.\n(Related policy: Non-internet-facing virtual machines should be protected with Network Security Groups)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1046"
        ]
    },
    {
        "unique_identifier": "18380005",
        "description": [
            {
                "field_data": "With the IP forwarding being enabled on a virtual machine network interface, it can receive traffic addressed to other destinations, which presents an isolation risk in multitenant environments (redirecting traffic to a single tenant). Also, an attacker can exploit this to route packets through the virtual machine and potentially bypass some firewalls and network filters, thereby gaining access to the machine.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control disables IP forwarding, but there may be a need to enable IP forwarding within the virtual machine's operating system, if there is a requirement for the appliance to forward traffic between private IP addresses assigned to Azure network interfaces.",
                "field_type": "impact"
            },
            {
                "field_data": "IP forwarding is the ability for a system to accept incoming network packets on one interface, recognize that it is not meant for the system itself, but that it should be passed on to another network, and then forwards it accordingly. When IP forwarding is enabled on a virtual machine's NIC (Network Interface), the machine can receive traffic addressed to other destinations. But it is rarely required (for example, when using the VM as a network virtual appliance), and therefore, this should be disabled.\n(Related policy: [Preview]: IP Forwarding on your virtual machine should be disabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1563.001"
        ]
    },
    {
        "unique_identifier": "18380006",
        "description": [
            {
                "field_data": "Without enabling the Just-in-time access for the management ports, all the virtual machines are potential targets for an attack, since attackers actively hunt accessible machines with open management ports like RDP or SSH. This way, an attacker will be able to attempt to gain access to the virtual machine through these open ports and can use it as an entry point to further attack the resources within the environment.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables Just-in-time for the management ports, which will only allow connections approved by NSG (Network Security Group). Thus, if there is a requirement to accept connections outside the NSG, it must not be enabled.",
                "field_type": "impact"
            },
            {
                "field_data": "Just-in-time (JIT) virtual machine access enables you to lock down your virtual machines in the network level by blocking inbound traffic to specific ports. It enables you to control the access and reduce the attack surface to your virtual machines, by allowing access only upon a specific need. It helps organizations provision access so that users only have the privileges to access the privileged accounts and resources when they need that access and not otherwise at any other times. Instead of granting always-on access (or standing access), organizations can use JIT access to limit access to a specific resource for a specific timeframe. This granular approach mitigates the risk of privileged account abuse by significantly reducing the amount of time an attacker or malicious insider has for gaining access to privileged accounts before moving laterally through a system and gaining unauthorized access to sensitive data.\n(Related policy: Management ports of virtual machines should be protected with just-in-time network access control)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1046"
        ]
    },
    {
        "unique_identifier": "18380007",
        "description": [
            {
                "field_data": "Without hardening the management ports, an attacker can attempt to gain access to all the Azure resources by performing attacks on the Azure virtual machines like Brute force, Sniffing, Eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "This control hardens the networking rules governing the management ports and which must be exercised with caution, ensuring that any authorised administrator or traffic is not denied access to the machine.",
                "field_type": "impact"
            },
            {
                "field_data": "Management ports are required by system admins to access and control the virtual machines from remote locations using Remote Desktop Protocol (RDP) and the Secure Shell (SSH) protocol. The potential security problem with using these protocols over the internet, is that attackers can use brute force techniques to gain access to Azure virtual machines. Hence, it is recommended that these ports should not always be open and accessible. They only need to be open at the time of performing management or maintenance tasks, therefore the access to these management ports on the virtual machines should be restricted by hardening the Network Security Group.\n(Related policy: Management ports should be closed on your virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499"
        ]
    },
    {
        "unique_identifier": "18380009",
        "description": [
            {
                "field_data": "Without using the Azure Disk Encryption for virtual machine disks, the data could easily be decrypted at a new location if someone copied it outside the environment, without requiring a key for decryption. Thus, any illegitimate user would be able to gain access to the disk information.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control encrypts the disk, which could take up a lot of memory (upto 8 GB). Thus, it must be done with caution or else the OS should be excluded from encryption.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Disk Encryption (ADE) leverages the industry standard BitLocker feature of Windows and the DM-Crypt feature of Linux to provide OS and data disk encryption to help protect and safeguard your data and help meet your organizational security and compliance commitments in customer Azure key vault. When your compliance and security requirement requires you to encrypt the data end to end using your encryption keys, including encryption of the ephemeral (locally attached temporary) disk, use Azure disk encryption. Thus it is recommended to encrypt your virtual machine disks using Azure Disk Encryption both for Windows and Linux virtual machines. \n(Related policy: Disk encryption should be applied on virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1119",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18380011",
        "description": [
            {
                "field_data": "Without enabling Guest configuration extension on the machine, the In-Guest Policy couldn't be run on it, leaving the system and security policies on the customer machines unmonitered. This way, any intruder can tamper or introduce undesired changes in system security policies without getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables Guest Configuration Extension, which only audits settings inside the virtual machine and doesn't actually apply the configurations. Also, this extension will not be able to support several old operating systems which are still available in Azure marketplace, which should be checked before remediating this control.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Policy can audit settings inside a machine, both for machines running in Azure and Arc Connected Machines. The validation is performed by the Guest Configuration extension and client. The extension, through the client, validates settings such as the configuration of the operating system, application configuration or presence Evironment settings. Thus it is recommended to enable Guest Configuration extension to audit the state of machines in your environment, including machines in Azure and Arc Connected Machines.Once installed, in-guest policies will be available such as 'Windows Exploit guard should be enabled'.\n(Related policy: Audit prerequisites to enable Guest Configuration policies on Windows VMs)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002"
        ]
    },
    {
        "unique_identifier": "18380012",
        "description": [
            {
                "field_data": "Without installing endpoint protection, the attack surface of virtual machine is increased and it is more susceptible to various viruses and malicious softwares. Also, no alerts will be generated when known malicious or unwanted software tries to install itself or run on the virtual machines.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs endpoint protection for virtual machine, which will incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "Installing endpoint protection systems (like Antimalware for Azure) provides for real-time protection capability that helps identify and remove viruses, spyware, and other malicious software. It offers three ways to help protect your virtual machine from malware and other potentially unwanted software which include Realtime Protection, Scanning Options and Detections. Thus it is recommended to install enpoint protection on your virtual machines to keep it protected from commonly identifiable threats.\n(No related policy)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195",
            "T1210"
        ]
    },
    {
        "unique_identifier": "18380013",
        "description": [
            {
                "field_data": "Without installing Log Analytics agent, it will not be possible to collect logs and performance data from virtual or physical machines and send it to a Log Analytics workspace to take advantage of features supported by Azure Monitor Logs such as log queries where the logs can be analyzed together using a sophisticated query language that's capable of quickly analyzing millions of records, which can bring out critical patterns (like resource usage insights, protocol failures, network outages etc) in the monitoring data with the help of which the organisation can solve detected problems as quickly as possible or prevent them before they happen.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs Log Analytics agent, which cannot send data to Azure Monitor Metrics, Azure Storage, or Azure Event Hubs. Also, it is difficult to configure unique monitoring definitions for individual agents and manage at scale, since each virtual machine has a unique configuration, thus it must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "The Log Analytics agent collects monitoring data from the guest operating system and workloads of virtual machines in Azure, other cloud providers, and on-premises. It sends data to a Log Analytics workspace. The Log Analytics agent is the same agent used by System Center Operations Manager, and it can multihome agent computers to communicate with your management group and Azure Monitor simultaneously. This agent is also required by certain insights in Azure Monitor and other services in Azure. Thus, it is recommended to install the log analytics agent.\n(No related policy)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1578",
            "T1072"
        ]
    },
    {
        "unique_identifier": "18380014",
        "description": [
            {
                "field_data": "Without the dependency agent installed, the data of various processes running on virtual machine will not be collected and the service map solution cannot be used ( it automatically discovers application components on Windows and Linux systems and maps the communication between services).",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs dependency agent which collects discovered data about processes running on the machine and external process dependencies.",
                "field_type": "impact"
            },
            {
                "field_data": "Security Center uses the Microsoft Monitoring Dependency Agent to collect network traffic data from your Azure virtual machines to enable advanced network protection features such as traffic visualization on the network map, network hardening recommendations and specific network threats. The Dependency agent collects discovered data about processes running on the virtual machine and external process dependencies.\n(Related policy: [Preview]: Network traffic data collection agent should be installed on Linux virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210",
            "T1557"
        ]
    },
    {
        "unique_identifier": "18380015",
        "description": [
            {
                "field_data": "Without the dependency agent installed, the data of various processes running on virtual machine will not be collected and the service map solution cannot be used ( it automatically discovers application components on Windows and Linux systems and maps the communication between services).",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs dependency agent which collects discovered data about processes running on the machine and external process dependencies.",
                "field_type": "impact"
            },
            {
                "field_data": "Security Center uses the Microsoft Monitoring Dependency Agent to collect network traffic data from your Azure virtual machines to enable advanced network protection features such as traffic visualization on the network map, network hardening recommendations and specific network threats. The Dependency agent collects discovered data about processes running on the virtual machine and external process dependencies.\n(Related policy: [Preview]: Network traffic data collection agent should be installed on Windows virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210",
            "T1557"
        ]
    },
    {
        "unique_identifier": "18380016",
        "description": [
            {
                "field_data": "Without migrating to the Azure Resource Manager, the default manager is Azure Classic in which the resource states, policies, and tags are all managed individually which becomes a management challenge as the individual virtual amchines are liable to be left running, or untagged. Also, if any wrong permission is assigned to a machine, it would be difficult to rectify it as a whole and each machine will have to be checked individually which always has scope of error.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control ensures that the Azure Classic is migrated to the new Azure Resource Manager, thus any group operations (like delete) must be exercised with caution as it might contain some resource that might be required to exist independently.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Classic and Azure Resource Manager (ARM) are two different deployment models for Azure VMs. In the classic model, resources exist independently, without groups for applications. In the classic deployment model, resource states, policies, and tags are all managed individually. If you need to delete resources, you do so individually. This quickly becomes a management challenge, with individual VMs liable to be left running, or untagged, or with the wrong access permissions. Use Azure Resource Manager for your virtual machines to provide security enhancements such as: stronger access control (RBAC), better auditing, Resource Manager-based deployment and governance, access to managed identities, access to key vault for secrets, Azure AD-based authentication and support for tags and resource groups for easier security management.\n(Related policy: Virtual machines should be migrated to new Azure Resource Manager resources)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1078"
        ]
    },
    {
        "unique_identifier": "18380017",
        "description": [
            {
                "field_data": "Without a vulnerability assessment solution installed, a number of open vulnerabilities like remote cloud execution(an action which involves an attacker executing code remotely using system vulnerabilities) can go undetected which can double up as openings for an attacker to gain access to the operations of a virtual machine remotely and make breaking changes.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables a built-in vulnerability assessment solution and also provides other thrid party vulnerability assessment scanners, the usage of which may require licensing and incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability assessment scanner works by deploying various assessment extensions on your machine, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings to Security Center. Thus it is recommended to install a  vulnerability assessment solution (included with Azure Defender) to enable a best of breed vulnerability assessment solution on your virtual machines.\n(Related policy: Vulnerabilities should be remediated by a Vulnerability Assessment solution)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190",
            "T1046",
            "T1210"
        ]
    },
    {
        "unique_identifier": "18380018",
        "description": [
            {
                "field_data": "Without setting up backups for the virtual machine, any data crash or loss of data shall become impossible to recover or may take up days, weeks or even months to recover and rebuild. Also, the backups can be used to verify the integrity of existing data incase of a data breach.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this controls enables backups for the Virtual Machine, the costs of which are not included in virtual machine costs, thus it will incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Backup is an Azure-native, cost-effective, data protection solution. It creates recovery points that are stored in geo-redundant recovery vaults. If a restore is done from a recovery point, the whole VM can be restored as well as specific files. Hence it is recommended to protect the data on the Azure virtual machines with Azure Backup. \n(Related policy: [Preview]: Azure Backup should be enabled for virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18380019",
        "description": [
            {
                "field_data": "Without resolving endpoint health issues, the installed endpoint protection won't function properly and any attacker can misuse and exploit endpoint deployments to breach into the system.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control resolves endpoint health issues, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "Endpoint protection systems (like Antimalware for Azure) provides real-time protection capability that helps identify and remove viruses, spyware, and other malicious software. It offers three ways to help protect your virtual machine from malware and other potentially unwanted software which include Realtime Protection, Scanning Options and Detections. However, the health issues associated with it must be resolved in order to ensure that installed endpoint protection is fully functioning without any errors. Therefore it is recommended to resolve endpoint protection health issues.   \n(This recommendation is dependent upon the recommendation \"Install endpoint protection solution on your machines\" and its policy)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.000"
        ]
    },
    {
        "unique_identifier": "18380020",
        "description": [
            {
                "field_data": "Without resolving the agent health issues, the coverage of Log Analytics agent may be partial, security events won't be properly processed, and in turn threat detection for the affected virtual machines may fail to function, resulting in undetected vulnerabilities which could have been identified through threat detection.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will resolve all the health issues, however if the monitoring state is \"Power state off\", then there maybe a need to restart the machine, which must be done after ensuring all the recently done work on it is saved.",
                "field_type": "impact"
            },
            {
                "field_data": "The Log Analytics agent (formerly known as the Microsoft Monitoring Agent) collects monitoring data from the guest operating system and workloads of virtual machines in Azure, other cloud providers, and on-premises. To make sure that your virtual machines are successfully monitored, you need to make sure the agent is both installed on the virtual machines and properly collects security events to the configured workspace. In some cases, the agent may fail to properly report security events, due to multiple health issues. In these cases, coverage may be partial - security events won't be properly processed, and in turn threat detection for the affected VMs may fail to function. Hence, it is recommended to resolve all the agent health issues for your machine. View remediation steps for more information on how to resolve each issue.\n(No related policy - dependent upon \"Log Analytics agent health issues should be resolved on your machines\")",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.001"
        ]
    },
    {
        "unique_identifier": "18380021",
        "description": [
            {
                "field_data": "Without installing the system updates for the virtual machines, the machine will be vulnerable to many security holes, as outdated software is prone to malware infections and other cyber concerns like Ransomware. Also, plenty of bugs and issues that may have been patched will remain unfixed, thereby decreasing the user experience.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will install the latest system updates, which must be done with caution and it must be ensured that the existing functionalities do not get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "System updates are necessary to maintain operational efficiency, overcome security issues, and reduce the risks of increased cyber security threats. Hence, it is recommended to install the system updates to keep your virtual machines up to date with latest security developments.\n(Related policy: System updates should be installed on your machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210"
        ]
    },
    {
        "unique_identifier": "18380022",
        "description": [
            {
                "field_data": "Without the security configuration vulnerabilites being remediated, a number of operating system vulnerabilities that include data breaches, account takeovers or getting infected with malwares and ransomwares, can compromise the operating system and cause loss of data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control removes the security configuration vulnerabilities, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "The operating system of Azure virtual machines are vulnerable to many cyber attacks. Azure Security Center analyzes daily the operating system of the virtual machines for configurations that could make these virtual machines more vulnerable to cyber attacks. The Security Center service also recommends specific configuration changes that can be applied in order to address any found operating system vulnerabilities. Hence, these recommendations must be followed in order to remediate the vulnerabilites that the operating system is prone to. \n(Related policy: Vulnerabilities in security configuration on your machines should be remediated)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18380023",
        "description": [
            {
                "field_data": "Without restarting the virtual machine, the system updates will not be applied even after getting installed, thereby making all the enhancements brought in by those updates futile.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will restart the virtual machine, which must be done after ensuring all the recently done work on it is saved. There may also be a little delay before the virtual machine starts and is available for use again.",
                "field_type": "impact"
            },
            {
                "field_data": "System updates are necessary to maintain operational efficiency, overcome security issues, and reduce the risks of increased cyber security threats. Thus, it is recommended to secure the virtual machine by restarting it which will apply the installed system updates.\n(No related policy - dependent upon \"System updates should be installed on your machines\")",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210"
        ]
    },
    {
        "unique_identifier": "18380024",
        "description": [
            {
                "field_data": "Without a vulnerability assessment solution installed and the reported vulnerabilites remediated, a number of open vulnerabilities like remote cloud execution(an action which involves an attacker executing code remotely using system vulnerabilities) can still be exploited even after getting detected by the vulnerability assessment, which can double up as openings for an attacker to gain access to the operations of a virtual machine remotely and make breaking changes to it.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control removes reported vulnerabilities, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The inbuilt vulnerability scanner works by deploying various assessment extensions on your machine, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings to Security Center. However, all the vulnerability findings must be remediated to get the full benefit of Vulnerability assessment solution to secure your virtual machine.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18380025",
        "description": [
            {
                "field_data": "Without updating allowlist for the virtual machine, any new malicious or unauthorized software that may cause destruction of virtual machine and it's data will not be detected and remediated by the security center.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control updates the allowlist of known safe applications, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "Application control policy helps us to deal with malicious and unauthorized software, by allowing only specific applications to run on the machines. Security Center analyzes data of applications using machine learning to find machines for which there is a constant set of running applications and suggest a list of known-safe applications. It creates allowlist rules for each group and presents the rules in the form of a recommendation. Once the recommendation is resolved, Security Center configures it by leveraging Applocker capabilities. Thus, it is recommended to update allowlist rules in the adaptive application control policy.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1562.006",
            "T1528"
        ]
    },
    {
        "unique_identifier": "18380026",
        "description": [
            {
                "field_data": "If the setting is not enabled then it will not protect the customer data and data will be at risk and data breach could happen.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If the remediation of this control is performed then, it does not secure data on end systems, it simply ensures the secure delivery of data over the Internet, avoiding possible eavesdropping and/or alteration of the content.",
                "field_type": "impact"
            },
            {
                "field_data": "To protect the privacy of information communicated over the Internet, the web servers should use the latest version of the industry-standard cryptographic protocol, Transport Layer Security (TLS). TLS secures communications over a network by using security certificates to encrypt a connection between machines. TLS\n1. 3 is faster and more secure than the earlier versions: TLS\n1. 0-1.2 and SSL 2-3, which are all considered legacy protocols.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537",
            "T1537"
        ]
    },
    {
        "unique_identifier": "18380027",
        "description": [
            {
                "field_data": "NA",
                "field_type": "businessDescription"
            },
            {
                "field_data": "NA",
                "field_type": "impact"
            },
            {
                "field_data": "SQL Vulnerability assessment scans your database for security vulnerabilities, and exposes any deviations from best practices such as misconfigurations, excessive permissions, and unprotected sensitive data. Resolving the vulnerabilities found can greatly improve your database security posture. Learn more",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18380046",
        "description": [
            {
                "field_data": "Defender for Cloud has analyzed the internet traffic communication patterns of the virtual machines listed below, and determined that the existing rules in the NSGs associated to them are overly-permissive, resulting in an increased potential attack surface.This typically occurs when this IP address doesn't communicate regularly with this resource. Alternatively, the IP address has been flagged as malicious by Defender for Cloud's threat intelligence sources. Learn more in https://docs.microsoft.com/azure/defender-for-cloud/adaptive-network-hardening?wt.mc_id=defenderforcloud_inproduct_portal_recoremediation Improve your network security posture with adaptive network hardening.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1021",
            "T1046",
            "T1048",
            "T1072",
            "T1090",
            "T1095",
            "T1199",
            "T1219",
            "T1482",
            "T1498",
            "T1499",
            "T1570",
            "T1571",
            "T1602",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18380047",
        "description": [
            {
                "field_data": "Remediate vulnerabilities in security configuration on machines with Docker installed to protect them from attacks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1005",
            "T1021",
            "T1040",
            "T1068",
            "T1083",
            "T1548"
        ]
    },
    {
        "unique_identifier": "18380050",
        "description": [
            {
                "field_data": "Install an endpoint protection solution on your virtual machines, to protect them from threats and vulnerabilities.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1027",
            "T1105",
            "T1566",
            "T1204"
        ]
    },
    {
        "unique_identifier": "18380051",
        "description": [
            {
                "field_data": "Protect your VM from potential threats by restricting access to it with a network security group (NSG). NSGs contain a list of Access Control List (ACL) rules that allow or deny network traffic to your VM from other instances, in or outside the same subnet. To keep your machine as secure as possible, the VM access to the internet must be restricted and an NSG should be enabled on the subnet. VMs with 'High' severity are internet-facing VMs.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1021",
            "T1046",
            "T1048",
            "T1072",
            "T1090",
            "T1095",
            "T1199",
            "T1219",
            "T1482",
            "T1498",
            "T1499",
            "T1570",
            "T1571",
            "T1602",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18380052",
        "description": [
            {
                "field_data": "Remediate vulnerabilities in security configuration on your machines to protect them from attacks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1548",
            "T1087",
            "T1003",
            "T1556"
        ]
    },
    {
        "unique_identifier": "18380054",
        "description": [
            {
                "field_data": "Remediate vulnerabilities in security configuration on your Linux machines to protect them from attacks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1212",
            "T1211",
            "T1210",
            "T1203",
            "T1190",
            "T1133",
            "T1068"
        ]
    },
    {
        "unique_identifier": "18380055",
        "description": [
            {
                "field_data": "Remediate vulnerabilities in security configuration on your Windows machines to protect them from attacks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1212",
            "T1211",
            "T1210",
            "T1203",
            "T1190",
            "T1133",
            "T1068"
        ]
    },
    {
        "unique_identifier": "18390001",
        "description": [
            {
                "field_data": "If secure transfer to storage account is not enabled, then the request from any insecure connections to these storage accounts will also be accepted. Thus, the storage data will always be vulnerable to several network layer attacks such as man-in-the-middle, eavesdropping, and session-hijacking.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Enabling secure transfer to storage accounts will reject all the connections made over http.",
                "field_type": "impact"
            },
            {
                "field_data": "An Azure storage account contains data objects such as files, blobs, queues, tables, and disks. It provides a unique namespace for the storage data that is accessible from anywhere in the world over http or https. All data stored within these storage accounts should be secure, scalable, durable, and highly available. It is recommended to enable secure transfer to the storage accounts as it will ensure that the requests only from secure connections (https) will be accepted and any request originating from an insecure connection will be rejected. Also, use of secure transfer will protect the storage data from any kind of network layer attacks, such as man-in-the-middle, eavesdropping, and session-hijacking.\n(Related policy: Secure transfer to storage accounts should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18390002",
        "description": [
            {
                "field_data": "If the access to the Azure storage account is not restricted using firewall and virtual network configurations, then any attacker will be able to access these storage accounts without getting detected, through the use of malicious IP addresses or public endpoints.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If the access to Azure storage account is restricted by configuring virtual network and firewall, then any incoming request other than the one originating from any service that is operating within an Azure virtual network or an allowed IP address, will be blocked.",
                "field_type": "impact"
            },
            {
                "field_data": "An Azure storage account contains data objects such as files, blobs, queues, tables, and disks. Configuring firewalls and virtual networks for a storage account will enable us to secure and control the level of access to these storage accounts by the applications. It will ensure that the requests originating from specified IP addresses, IP ranges or from a list of subnets in an Azure virtual network are able to access the storage account. It will also help us in controlling the access for the public endpoints(accessible through the internet) of the storage accounts.\n(Related policy: Audit unrestricted network access to storage accounts)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18390005",
        "description": [
            {
                "field_data": "If the Microsoft-managed key is used instead of a customer-managed key for encrypting the storage account, then the key's creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the Microsoft-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the storage accounts, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the storage account inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Storage account's content, by default, is encrypted by the Microsoft-managed keys (transparent to the application and are managed by Microsoft). In order to enhance the security, an additional layer of encryption should be applied using a customer-managed key (created by a customer and stored in the key vault or generated using the Azure key vault's APIs). Customer-managed keys enables a customer to encrypt the data with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management. Hence, it is recommended to use customer-managed keys to encrypt the storage account.\n(Related policy: Storage accounts should use customer-managed key (CMK) for encryption)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18390006",
        "description": [
            {
                "field_data": "If access to storage account is not restricted by the virtual network rules, then any attacker will be able to gain access to the data present in the storage account from malicious IP addresses or domains without getting detected. Along with this, the storage account will also be susceptible to other network attacks like DDoS, Eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If the access to the storage accounts is restricted by configuring the virtual network rules, then any incoming request other than the one originating from any service that is operating within an Azure virtual network or an allowed IP address, will be blocked. Hence, it must be exercised cautiously so that all the trusted resources and services are able to access the storage account.",
                "field_type": "impact"
            },
            {
                "field_data": "A storage account by default accepts connections over the internet from hosts on any network. To protect the storage account from potential threats, it must be ensured that access is restricted to only specific public IP addresses or address ranges by configuring the virtual network rules of the storage account.\n(Related policy: Storage accounts should restrict network access using virtual network rules)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18400001",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in virtual machine scale set, one will not be able to diagnose actions and operations responsible for any security incidents within virtual machine scale set, which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for virtual machine scale set, however those logs cannot be sent to Log Analytics workspace for analysis and only sends logs to Azure storage and Event Hubs.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure virtual machine scale sets let you create and manage a group of load balanced virtual machines. The Diagnostic Logs are logs emitted by a resource and provide rich and frequent insights into the operations of that resource. The virtual machine scale set uses the data of the diagnostic logs on the virtual machines for autoscaling purpose. These logs enables you to recreate activity trails for investigation purposes. This is useful when a security incident occurs, or your network is compromised. Therefore, it is recommended to enable diagnostic logs for virtual machine scale set.\n(Related policy: Diagnostic logs in Virtual Machine Scale Sets should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18400002",
        "description": [
            {
                "field_data": "Without resolving endpoint health issues, the installed endpoint protection won't function properly and it's provided protection for endpoints will be faulty. This way any attacker will still be able to misuse and exploit endpoint deployments and because it has access to both the central server and the outside world, any flaw or gap in it's security will increase the likelihood of loss of crucial data from the server.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control resolves endpoint health issues, which will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Endpoint protection systems (like Antimalware for Azure) provides real-time protection capability that helps identify and remove viruses, spyware, and other malicious software. It offers three ways to help protect your virtual machine scale set from malware and other potentially unwanted software which include Realtime Protection, Scanning Options and Detections. However, the health issues associated with it must be resolved in order to ensure that installed endpoint protection is fully functioning without any errors. Therefore, it is recommended to resolve endpoint protection health issues.   \n(No related policy - dependent upon \"Endpoint protection solution should be installed on virtual machine scale sets\")",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.000"
        ]
    },
    {
        "unique_identifier": "18400003",
        "description": [
            {
                "field_data": "Without installing endpoint protection, the attack surface of virtual machine scale set is increased, as the endpoints have access to both the central server and the outside world making it more susceptible to various viruses and malicious softwares. Also, no alerts will be generated when known malicious or unwanted software tries to install itself or run on virtual machine scale set.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs endpoint protection for virtual machine scale set, which will incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "Installing endpoint protection systems (like Antimalware for Azure) provides for real-time protection capability that helps identify and remove viruses, spyware, and other malicious software. It offers three ways to help protect your virtual machine scale set from malware and other potentially unwanted software which include Realtime Protection, Scanning Options and Detections. Thus, it is recommended to install enpoint protection on your virtual machine scale set to keep it protected from commonly identifiable threats.\n(Related policy: Endpoint protection solution should be installed on virtual machine scale sets)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195",
            "T1210"
        ]
    },
    {
        "unique_identifier": "18400004",
        "description": [
            {
                "field_data": "Without installing Log Analytics agent, it will not be possible to collect logs and performance data from virtual machine scale sets and send it to a Log Analytics workspace to take advantage of features supported by Azure Monitor Logs such as log queries where the logs can be analyzed together using a sophisticated query language that's capable of quickly analyzing millions of records, which can bring out critical patterns (like resource usage insights, protocol failures, network outages etc) in your monitoring data with the help of which the organisation can solve detected problems as quickly as possible or prevent them before they happen.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs Log Analytics agent, which will not have any impact, however the collected data cannot be sent to the Azure Monitor Metrics, Azure Storage, or Azure Event Hubs. Also, it is difficult to configure unique monitoring definitions for individual agents and manage individual scale set configurations, thus it's implementation must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "The Log Analytics agent collects monitoring data from the guest operating system and workloads of virtual machines in Azure, other cloud providers, and on-premises. It sends data to a Log Analytics workspace. The Log Analytics agent is the same agent used by System Center Operations Manager, and you can multihome agent computers to communicate with your management group and Azure Monitor simultaneously. Auto-deployment of the agent for Azure virtual machine scale sets cannot be configured, therefore log analytics agent should be deployed on virtual machine scale sets (including those used by Azure managed services such as Azure Kubernetes Service and Azure Service Fabric).",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1578",
            "T1072"
        ]
    },
    {
        "unique_identifier": "18400005",
        "description": [
            {
                "field_data": "Without installing the system updates for the Windows and Linux virtual machine scale set, it will be vulnerable to many security loopholes, as outdated software is prone to malware infections. Also, plenty of bugs and issues that may have been patched will remain unfixed, thereby decreasing the user experience.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control will install the latest system updates, which must be done with caution and it must be ensured that the existing functionalities don't get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "System updates are necessary to maintain operational efficiency, overcome security issues, and reduce the risks of increased cyber security threats. Hence, it is recommended to install the system updates to keep your Windows and Linux virtual machine scale set up to date with latest security developments.\n(Related policy: System updates on virtual machine scale sets should be installed)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1210"
        ]
    },
    {
        "unique_identifier": "18400006",
        "description": [
            {
                "field_data": "Without the security configuration vulnerabilites being remediated, a number of operating system vulnerabilities that include data breaches, account takeovers or infecting with malwares and ransomwares, can compromise the operating system and cause loss of data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control removes the security configuration vulnerabilities, which must be done with caution and it must be ensured that the existing functionalities don't get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "The operating system of the virtual machines are vulnerable to many cyber attacks. Azure Security Center analyzes daily the operating system of the virtual machines for configurations that could make them more vulnerable to cyber attacks. The Security Center service also recommends specific configuration changes that can be applied in order to address any found operating system vulnerabilities. Hence, these recommendations must be followed in order to remediate the vulnerabilites that the operating system is prone to. \n(Related policy: Vulnerabilities in security configuration on your virtual machine scale sets should be remediated)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18410001",
        "description": [
            {
                "field_data": "If Azure Defender is not enabled for container registries (that stores and manages the container images for Azure deployments) then the Security Center will not be able to run the vulnerability scan and provide actionable recommendations and remediation guidelines to fix vulnerabilities for the images that are pushed to the registry, imported into the registry, or pulled within the last 30 days.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for container registries, then additional charges will be incurred for the scan of each image that is immediately pushed into the registry or pulled within the last 30 days.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Container Registry (ACR) is a managed, private docker registry service that stores and manages the container images for Azure deployments. Once Azure Defender for container registries is enabled, the Security Center will scan images that are pushed to the registry, imported into the registry, or pulled within the last 30 days. Incase a vulnerability is found, then it will be notified in the Security Center's dashboard along with the actionable recommendations, severity classification, and remediation guidance. But this feature of scanning vulnerabilities of the images will incur charges per image. To build secure containerized workloads, ensure the images that they're based on are free of known vulnerabilities using Azure Defender.\nImportant: Remediating this recommendation will result in charges for protecting the ACR registries. If we don't have any ACR registries in the subscription, no charges will be incurred. If we create any ACR registries on the subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on Azure Container Registry registries)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1068",
            "T1190"
        ]
    },
    {
        "unique_identifier": "18410002",
        "description": [
            {
                "field_data": "If Azure Defender for kubernetes is not enabled, then attacks like resource hijacking can be carried out without generating any alert or getting detected, which may compromise container data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for kubernetes cluster to provide real-time threat protection, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Kubernetes Service (AKS) is an open-source software for deploying, managing and scaling containers that are used for building modern applications. Azure Defender for kubernetes should be enabled as it provides real-time threat protection of the kubernetes cluster(multi-containers) and generates alerts for suspicious activities. We can use this information to quickly remediate security issues and improve the security of our containers. \nImportant: Remediating this recommendation will result in charges for protecting your AKS clusters. If you don't have any AKS clusters in this subscription, no charges will be incurred. If you create any AKS clusters on this subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on Azure Kubernetes Service clusters)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1189",
            "T1189",
            "T1195.001",
            "T1195.002"
        ]
    },
    {
        "unique_identifier": "18410003",
        "description": [
            {
                "field_data": "If Azure Defender for App Service is not enabled, then attacks like SQL injection or cross-site scripting can go undetected and the attacker can access the App Service and the resources covered by it.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for App Service and it's resources, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure App Service is a fully managed web hosting service for building web apps, mobile back ends and RESTful APIs. Azure Defender for App Service uses cloud scaling to identify attacks targeting applications running over App Service. Attackers probe web applications to find and exploit weaknesses. Before being routed to specific environments, requests to applications running in Azure go through several gateways, where they're inspected and logged. This data is then used to identify exploits and attacks, and to learn new patterns that will be used later. By using the visibility that Azure has as a cloud provider, Security Center analyzes App Service internal logs to identify attack methodology on multiple targets and generate security recommendations based on its findings.\nImportant: Remediating this recommendation will result in charges for protecting your App Service plans. If there are no App Service plans in the subscription, no charges will be incurred. If we create any App Service plans on the subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on Azure App Service plans)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1505.003",
            "T1505.003",
            "T1505.003",
            "T1505.003"
        ]
    },
    {
        "unique_identifier": "18410004",
        "description": [
            {
                "field_data": "If Azure Defender for servers is not enabled, then any attack like DDOS and brute force can break the servers without causing alerts or getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for real-time threat protection to server, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for servers provides real-time threat protection for the server workloads and generates hardening recommendations as well as alerts about suspicious activities. We can use this information to quickly remediate security issues and improve the security of our virtual machines.\nImportant: Remediating this recommendation will result in charges for protecting our virtual machines. If we don't have any virtual machines in the subscription, no charges will be incurred. If we create any virtual machines on the subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on virtual machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1505",
            "T1505"
        ]
    },
    {
        "unique_identifier": "18410005",
        "description": [
            {
                "field_data": "If Azure Defender for SQL Database servers is not enabled then we will not be able to detect anomalous database access patterns and mitigate potential database vulnerabilities such as Azure SQL injection attacks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for protecting SQL Database servers, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for SQL Database servers is a unified package that provides advanced SQL security capabilities. It includes functionality for surfacing and mitigating potential database vulnerabilities, detecting anomalous activities that could indicate a threat to the database, and discovering and classifying sensitive data.\nImportant: Remediating this recommendation will result in charges for protecting the Azure SQL Database servers. If we don't have any Azure SQL Database servers in the subscription, no charges will be incurred. If we create any Azure SQL Database servers on this subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced data security should be enabled on Azure SQL Database servers)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499",
            "T1499.002",
            "T1499.003",
            "T1499.004"
        ]
    },
    {
        "unique_identifier": "18410006",
        "description": [
            {
                "field_data": "If Azure Defender for SQL servers on machines is not enabled then we will not be able to detect and mitigate potential database vulnerabilities such as Azure SQL injection attacks and will not receive any alerts in case of a threat.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for protecting SQL servers on machines, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for SQL servers is a unified package that provides advanced SQL security capabilities. It includes functionality for surfacing and mitigating potential database vulnerabilities, detecting anomalous activities that could indicate a threat to the database, and discovering and classifying sensitive data. It will also provide alerts when there are suspicious database activities, potential vulnerabilities, or SQL injection attacks, and anomalous database access and query patterns.\nImportant: Remediating this recommendation will result in charges for protecting the SQL servers on machines. If we don't have any SQL servers on machines in the subscription, no charges will be incurred. If we create any SQL servers on machines on the subscription in the future, they will automatically be protected and charges will begin at that time. \n(Related policy: Advanced data security should be enabled on SQL servers on machines)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499",
            "T1499.002",
            "T1499.003",
            "T1499.004"
        ]
    },
    {
        "unique_identifier": "18410007",
        "description": [
            {
                "field_data": "If Microsoft Defender is not enabled for Storage accounts, then any access from suspicious IPs, anomalous access patterns or any malware uploads to storage shall go undetected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Microsoft Defender is enabled for Storage accounts, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure storage account contains all of the Azure Storage data objects: blobs, files, queues, tables, and disks. The storage account provides a unique namespace for the Azure Storage data that is accessible from anywhere in the world over HTTP or HTTPS. Azure Defender for Storage detects unusual and potentially harmful attempts to access or exploit the Storage accounts.\nImportant: Remediating this recommendation will result in charges for protecting your Azure Storage accounts. If we don't have any Azure Storage accounts in the subscription, no charges will be incurred. If we create any Azure Storage accounts on the subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on Azure Storage accounts)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1055.005",
            "T1055.005",
            "T1078",
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410008",
        "description": [
            {
                "field_data": "If more than three owners are assigned to a subscription, then there will be an increased probability of an owner account getting compromised and an increased attack surface, thereby giving owner privileges to an attacker, with which breaking changes can be made.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If there is a business requirement to have more than three owners to a subscription, then the remediation of this control should not be carried out.",
                "field_type": "impact"
            },
            {
                "field_data": "Subscription owners are the users who have full access to all the resources in the subscription, including the right to delegate access to others. If more than three subscription owners are designated to a subscription then it will increase the chances of a compromised owner's account being used to gain access to the subscription and hence lead to a potential breach of security. It is recommended to keep a maximum of three owners to a subscription and monitor the number of owners via Azure Security Center to enforce this best practice.\n(Related policy: A maximum of 3 owners should be designated for your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410009",
        "description": [
            {
                "field_data": "If Microsoft Defender for Key Vault is not enabled then you will not be able to detect unusual and potentially harmful access attempts that could lead to the Key Vault accounts being exploited, which could lead to the loss of confidential data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Microsoft Defender is enabled for Azure Key Vault accounts, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Key Vault is a cloud service that safeguards encryption keys and secrets like certificates, connection strings, and passwords. Enabling Azure Defender for Key Vault will provide advanced threat protection and add an additional layer of security intelligence. It will detect unusual and potentially harmful attempts to access or exploit Key Vault accounts. If an anomalous activity occurs then Azure Defender will send alerts via email to relevant members of the organization.\nImportant: Remediating this recommendation will result in charges for protecting your Azure Key Vaults. If we don't have any Azure Key Vaults in the subscription, no charges will be incurred. If we create any Azure Key Vault on the subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced threat protection should be enabled on Azure Key Vault vaults)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1552",
            "T1552"
        ]
    },
    {
        "unique_identifier": "18410010",
        "description": [
            {
                "field_data": "If deprecated account is not removed and is present in any role on the subscription, then any attacker can target these accounts for accessing the applications that are still allowing access to them without getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If there is no requirement of deprecated accounts in the future, then they can be removed without any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Deprecated accounts are the user accounts that have been blocked from signing in, and should be removed from the subscriptions. These accounts can be targets for attackers looking to find ways to access the data without being noticed. Therefore these accounts should be removed from the subscriptions to enable access to only current users.\n(Related policy: Deprecated accounts should be removed from your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1531",
            "T1531"
        ]
    },
    {
        "unique_identifier": "18410011",
        "description": [
            {
                "field_data": "If deprecated account with owner permissions is not removed and is present in any role on the subscription, then an attacker can misuse it for accessing data, view sensitive information and edit the data, all without getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If there is no requirement of deprecated accounts with owner permissions in the future, then they can be removed without any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Deprecated accounts are the user accounts that have been blocked from signing in, and should be removed from the subscriptions. These accounts can be targets for attackers looking to find ways to access the data without being noticed. Therefore these accounts should be removed from the subscriptions to enable access to only current users.\n(Related policy: Deprecated accounts with owner permissions should be removed from your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1531",
            "T1531"
        ]
    },
    {
        "unique_identifier": "18410012",
        "description": [
            {
                "field_data": "If external accounts with owner permissions are not removed from the subscription, then an attacker or an unauthorized user can gain access to the account from outside the domain, thus increasing the attack surface. With owner permissions, the attacker will be able to view sensitive data without being noticed (as these accounts are not managed or monitored by the organization) and put confidentiality of the account at risk, assign roles to the malicious accounts or manipulate the data present in the account making it unavailable for use.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If any of the external account is being used by subscriptions, then removing it will revoke its permissions. So, if there is a business requirement to allow an external account to use subscriptions then we should not remove it.",
                "field_type": "impact"
            },
            {
                "field_data": "External accounts in Azure AD are accounts having different domain names than the one which is being used in corporate identities (such as Azure AD B2B collaboration, Microsoft Accounts, etc.). Usually, these accounts are not managed or monitored by the organization and can be targets for attackers looking to find ways to access the data without being noticed. External accounts with owner privileges should be removed from the subscription in order to prevent unmonitored access.\n(Related policy: External accounts with owner permissions should be removed from your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1133",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410013",
        "description": [
            {
                "field_data": "If external accounts with read permissions are not removed from the subscription, then an attacker or an unauthorized user can gain access to the account from outside the domain, thus increasing the attack surface. With read permissions, the intruder will be able to view sensitive data without being noticed (as these accounts are not managed or monitored by the organization) and hence put the confidentiality of the data at risk.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If any of the external account is being used by subscriptions, then removing it will revoke its permissions. So, if there is a business requirement to allow an external account to use subscriptions then we should not remove it.",
                "field_type": "impact"
            },
            {
                "field_data": "External accounts in Azure AD are accounts having different domain names than the one which is being used in corporate identities (such as Azure AD B2B collaboration, Microsoft Accounts, etc.). Usually, these accounts are not managed or monitored by the organization and can be targets for attackers looking to find ways to access the data without being noticed. External accounts with read privileges should be removed from the subscription in order to prevent unmonitored access.\n(Related policy: External accounts with read permissions should be removed from your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1133",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410014",
        "description": [
            {
                "field_data": "If external accounts with write permissions are not removed from the subscription, then an attacker or an unauthorized user can gain access to the account from outside the domain, thus increasing the attack surface. With write permissions, the intruder will be able to view sensitive data without being noticed (as these accounts are not managed or monitored by the organization) and put confidentiality of the data at risk, as well as manipulate the data making it unavailable for use.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If any of the external account is being used by subscriptions, then removing it will revoke its permissions. So, if there is a business requirement to allow an external account to use subscriptions then we should not remove it.",
                "field_type": "impact"
            },
            {
                "field_data": "External accounts in Azure AD are accounts having different domain names than the one which is being used in corporate identities (such as Azure AD B2B collaboration, Microsoft Accounts, etc.). Usually, these accounts are not managed or monitored by the organization and can be targets for attackers looking to find ways to access the data without being noticed. External accounts with write privileges should be removed from the subscription in order to prevent unmonitored access.\n(Related policy: External accounts with write permissions should be removed from your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1133",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410015",
        "description": [
            {
                "field_data": "If MFA is not enabled on accounts with owner permission, then it will be relatively easier for an attacker or an unauthorized user to gain access to the account and perform malicious activity such as assigning roles to the malicious accounts, after having to bypass only a single layer of authentication. The intruder will be able to view the sensitive data and put the confidentiality of the data at risk, as well as manipulate the data, making it unavailable for use.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Enabling MFA for accounts with owner permission will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Multi-Factor Authentication (MFA) is a process where a user is prompted during the sign-in process for an additional form of identification, such as to enter a code on the cellphone or to provide a fingerprint scan. Enabling Multi-Factor Authentication (MFA) for all subscription accounts with owner privileges will prevent the breach of accounts or resources present in the subscription.\n(Related policy: MFA should be enabled on accounts with owner permissions on your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002",
            "T1078.002",
            "T1556",
            "T1556",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410016",
        "description": [
            {
                "field_data": "If MFA is not enabled on accounts with read permission, then it will be relatively easier for an attacker or an unauthorized user to gain access to the account, after having to bypass only a single layer of authentication. The attacker will be able to view the sensitive data thereby putting the confidentiality of the data at risk.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Enabling MFA for accounts with read permission will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Multi-Factor Authentication (MFA) is a process where a user is prompted during the sign-in process for an additional form of identification, such as to enter a code on the cellphone or to provide a fingerprint scan. Enable Multi-Factor Authentication (MFA) for all subscription accounts with read privileges to prevent a breach of accounts or resources.\n(Related policy: MFA should be enabled on accounts with read permissions on your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002",
            "T1078.002",
            "T1556",
            "T1556",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410017",
        "description": [
            {
                "field_data": "If MFA is not enabled on accounts with write permission, then it will be relatively easier for an attacker or an unauthorized user to gain access to the account, after having to bypass only a single layer of authentication. The attacker will be able to view the sensitive data and put the confidentiality of the data at risk, as well as manipulate the data, making it unavailable for use.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Enabling MFA for accounts with write permission will not have any impact.",
                "field_type": "impact"
            },
            {
                "field_data": "Multi-Factor Authentication (MFA) is a process where a user is prompted during the sign-in process for an additional form of identification, such as to enter a code on the cellphone or to provide a fingerprint scan. Enable Multi-Factor Authentication (MFA) for all subscription accounts with write privileges to prevent a breach of accounts or resources.\n(Related policy: MFA should be enabled on accounts with write permissions on your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002",
            "T1078.002",
            "T1556",
            "T1556",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410019",
        "description": [
            {
                "field_data": "If a subscription does not have more than one owner then it would become difficult to recover the account in case of an account lockout or compromise. Hence, having multiple users with owner role will ensure business continuity.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Assigning more than one subscription owner will not have any impact, but the privileges must be assigned with precaution as the assignee will have full access to all resources in the subscription, including the right to delegate access to others. It must be ensured that the monitoring of these accounts is more extensive.",
                "field_type": "impact"
            },
            {
                "field_data": "Assigning an owner role to a user gives administrative access of the subscription to that user. It also gives the user full access to all resources in the subscription, including the right to delegate access to others. Hence it is recommended to designate more than one subscription owner in order to have multiple administrators, so that the potential for breach by a compromised owner is reduced.\n(Related policy: There should be more than one owner assigned to your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18410020",
        "description": [
            {
                "field_data": "If security contact details are not configured for the subscription then the security center will not send a notification email in case of a potential security breach, even when that anomaly is detected and recorded on the portal.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will configure the security contact email addresses of the users to whom the notifications will be sent in case of a security breach, therefore it is recommended to add email address of the user/team from the right department who can take action on this notification email.",
                "field_type": "impact"
            },
            {
                "field_data": "Security alerts should reach the right people in the organization, hence security contact details should be configured so that email notifications are sent from the Security Center to the relevant people in the organization in case of a potential security breach in one of the subscriptions.\n(Related policy: Subscriptions should have a contact email address for security issues)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410021",
        "description": [
            {
                "field_data": "If auto provisioning of Log Analytics agent is not enabled on the subscription and it is also not installed manually post VM provisioning, it may lead to security issues within the VM go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will automatically install Log Analytics agent on the virtual machines which will start logging data to Log Analytics Workspace resulting into the cost increase.",
                "field_type": "impact"
            },
            {
                "field_data": "To monitor for security vulnerabilities and threats, Azure Security Center collects security data and events from the Azure virtual machines. Data is collected by the Log Analytics agent, formerly known as the Microsoft Monitoring Agent (MMA), which reads various security related configurations and event logs from the machine and copies the data (including crash dump files) to the Log Analytics workspace for analysis. The data sent for analysis is required to provide visibility into missing updates, misconfigured operating system (OS) security settings, endpoint protection settings, and health and threat detections. When the automatic provisioning of the monitoring agent is turned on, the Azure Security Center installs the MMA on all the existing supported Azure virtual machines, plus on any new ones created later.\n(Related policy: Auto provisioning of the Log Analytics agent should be enabled on your subscription)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1578",
            "T1072"
        ]
    },
    {
        "unique_identifier": "18410022",
        "description": [
            {
                "field_data": "In absence of email notifications for high severity issues, a user or a security team would be required to visit the security center for monitoring the security incidents which may increase the turnaround time thus allowing a malicious user ample time to exploit the underlying issue.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will not have any impact, also relevant users will be notified via email in case of a high severity security alert.",
                "field_type": "impact"
            },
            {
                "field_data": "Enabling email notifications for high severity alerts ensures that in case of a potential security breach in one of the subscriptions, alerts will be sent via email to the relevant users of the organization, thereby helping the users to take necessary actions and mitigate the risk.\n(Related policy: Email notification for high severity alerts should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410023",
        "description": [
            {
                "field_data": "Without enabling email notifications to subscription owners for high severity alerts, the owner of the subscription will not get notified via email in case of a potential security breach.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will not have any impact, also the subscription owner will be notified via email in case of a high severity security alert.",
                "field_type": "impact"
            },
            {
                "field_data": "Enabling email notifications for subscription owners ensures that they receive security alert emails for important alert notifications, become aware of the security issues identified, and take necessary actions within the required time frame to mitigate the risk.\n(Related policy: Email notification to subscription owner for high severity alerts should be enabled)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1078",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18410024",
        "description": [
            {
                "field_data": "Network Watcher is a regional service that enables you to monitor and diagnose conditions at a network scenario level in, to, and from Azure. Scenario level monitoring enables you to diagnose problems at an end to end network level view. Network diagnostic and visualization tools available with Network Watcher help you understand, diagnose, and gain insights to your network in Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1557"
        ]
    },
    {
        "unique_identifier": "18410044",
        "description": [
            {
                "field_data": "User accounts that have been blocked from signing in, should be removed from your subscriptions. These accounts can be targets for attackers looking to find ways to access your data without being noticed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18410045",
        "description": [
            {
                "field_data": "User accounts that have been blocked from signing in, should be removed from your subscriptions.These accounts can be targets for attackers looking to find ways to access your data without being noticed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18410046",
        "description": [
            {
                "field_data": "Accounts with owner permissions that have different domain names (external accounts), should be removed from your subscription. This prevents unmonitored access. These accounts can be targets for attackers looking to find ways to access your data without being noticed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18410047",
        "description": [
            {
                "field_data": "Accounts with read permissions that have different domain names (external accounts), should be removed from your subscription. This prevents unmonitored access. These accounts can be targets for attackers looking to find ways to access your data without being noticed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18410048",
        "description": [
            {
                "field_data": "Accounts with write permissions that have different domain names (external accounts), should be removed from your subscription. This prevents unmonitored access. These accounts can be targets for attackers looking to find ways to access your data without being noticed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078"
        ]
    },
    {
        "unique_identifier": "18410049",
        "description": [
            {
                "field_data": "Multi-Factor Authentication (MFA) should be enabled for all subscription accounts with owner permissions to prevent a breach of accounts or resources.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1110"
        ]
    },
    {
        "unique_identifier": "18410050",
        "description": [
            {
                "field_data": "Multi-Factor Authentication (MFA) should be enabled for all subscription accounts with read privileges to prevent a breach of accounts or resources.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1110"
        ]
    },
    {
        "unique_identifier": "18410051",
        "description": [
            {
                "field_data": "Multi-Factor Authentication (MFA) should be enabled for all subscription accounts with write privileges to prevent a breach of accounts or resources.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078",
            "T1110"
        ]
    },
    {
        "unique_identifier": "18430001",
        "description": [
            {
                "field_data": "If the service-managed key is used instead of a customer-managed key for encrypting the container registry, then the key's creation, storage, rotation, and lifecycle will all be managed by Microsoft. Thereby, the organization would lose control over the data, making it easily decryptable by a third-party service provider. Hence, it is recommended to use the customer-managed key for the encryption of the container registry's data as a best security practice.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Custumer-managed keys can only be enabled at the time of the creation of container registry. Once the customer-managed key is enabled for a container registry, it cannot be disabled. Also, content trust (enabling pushing and pulling of signed images) is not supported in a container registry encrypted with a customer-managed key.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure container registry's content(images and other artifacts), by default, is encrypted by the service-managed keys (transparent to the application and are managed by Microsoft). Inorder to enhance the security, an additional layer of encryption should be applied using a customer-managed key (created by a customer and stored in the key vault or generated using the Azure key vault's APIs). Customer-managed keys enables a customer to encrypt the data with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management. Hence, it is recommended to use customer-managed keys to encrypt the container registries.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18430002",
        "description": [
            {
                "field_data": "If access to container registries is not restricted by IP/firewall rule, then any attacker will be able to gain access to the data present in the registry from malicious IP addresses or domains without getting detected. Along with this, the container registry will also be susceptible to other network attacks like DDoS, Eavesdropping, Jamming, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control can be performed for the Premium container registry service tier. If the access to private endpoints, selected subnets, or IP addresses is restricted then the Security Center will not be able to perform image vulnerability scanning (by Azure Defender) of the images in the container registry. Also, instances of certain Azure services including Azure DevOps Services, Web Apps, and Azure Container Instances will not be able to access a network-restricted container registry.",
                "field_type": "impact"
            },
            {
                "field_data": "An Azure container registry by default accepts connections over the internet from hosts on any network. To protect the container registries from potential threats, it must be ensured that access is restricted to only specific public IP addresses or address ranges by configuring the IP/firewall rule of the container registry.\n\nNote: Networking settings (IP access rule and service endpoint) can be configured only for premium container registries",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499"
        ]
    },
    {
        "unique_identifier": "18430003",
        "description": [
            {
                "field_data": "If private links are not configured for container registries, then any attacker will be able to gain access to the container registry's content from malicious public IP address or domain, without getting detected. Along with this, the container registry will also be susceptible to other network attacks like DDoS, Eavesdropping, Jamming, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control can be performed for the Premium container registry service tier. If the access to private endpoints, selected subnets, or IP addresses is restricted then the Security Center will not be able to perform image vulnerability scanning (by Azure Defender) of the images in the container registry. Also, instances of certain Azure services including Azure DevOps Services, Web Apps, and Azure Container Instances will not be able to access a network-restricted container registry.",
                "field_type": "impact"
            },
            {
                "field_data": "Access to the container registry can be restricted by assigning virtual network private IP addresses to the registry endpoints and using Azure Private Link. Network traffic between the clients on the virtual network and the registry's private endpoints traverses the virtual network and a private link on the Microsoft backbone network, eliminating exposure from the public internet. By mapping private endpoints to the container registries instead of the entire service, the container registry's content will also be protected against data leakage risks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537"
        ]
    },
    {
        "unique_identifier": "18440001",
        "description": [
            {
                "field_data": "If secure connections are not enabled for Redis Cache, then a malicious user within the network path will be able to gain unauthorized access to the data through Man-in-the-Middle attack.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only secure connections can access the the Redis Cache. However, before enabling access only via SSL for the Redis Cache, it must be ensured that all clients consuming the Redis instance have trusted certificate configured.",
                "field_type": "impact"
            },
            {
                "field_data": "Only secure connections via SSL should be able to access the Redis Cache. Use of secure connections ensures authentication between the server and the service and protects data in transit from network layer attacks such as man-in-the-middle, eavesdropping, and session-hijacking.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1573",
            "T1090.004"
        ]
    },
    {
        "unique_identifier": "18440002",
        "description": [
            {
                "field_data": "If Azure Cache for Redis is not configured inside a virtual network, then it exposes the service to internet users. A malicious user can attempt credential bruteforce to gain unauthorized access to the cached data.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the Azure Cache for Redis is not accessible publicly. However, the Network Security Groups(NSGs) and other network rules must be configured carefully, such that all the trusted client's network traffic is allowed to reach the Azure Cache for Redis instance.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure virtual network deployment provides enhanced security and isolation for the Azure Cache for Redis, along with subnets, access control policies, and other features to further restrict access. When an Azure Cache for Redis instance is configured with a virtual network, it is not publicly addressable and can only be accessed from virtual machines and applications within the virtual network.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1557"
        ]
    },
    {
        "unique_identifier": "18550001",
        "description": [
            {
                "field_data": "If HTTP is used for accessing the function app, then data will be transmitted in plain text thereby increasing the chances for an attacker to steal the sensitive information via network layer attacks such as man-in-the-middle, eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only secure connections can access the function app. However, before enabling only HTTPS access for the function app, it must be ensured that there isn't any existing resource that can only access the function app over HTTP.",
                "field_type": "impact"
            },
            {
                "field_data": "An Azure Function App is a collection of Azure functions (cloud service available on-demand that helps in building the web APIs, responding to the database changes, processing IoT streams, managing message queues, etc) that are grouped together as a logical unit, and are helpful in making the management, deployment, scaling, and sharing of resources easier. A client can connect to the function endpoints by using both HTTP (data is not encrypted and is transmitted in plain text) or HTTPS (data is encrypted and transmitted securely via SSL/TLS protocols). HTTPS protects the communication between the client and server from being intercepted and tampered with by attackers. This provides confidentiality, integrity and authentication.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1071.001",
            "T1071"
        ]
    },
    {
        "unique_identifier": "18550002",
        "description": [
            {
                "field_data": "If remote debugging is enabled on the function app, then the inbound ports used for debugging the function app can be used as an entry point by an attacker to access and exploit all the resources.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will turn off remote debugging for the function app, and user will not be able to remotely debug any issue that arises in any function after deployment.",
                "field_type": "impact"
            },
            {
                "field_data": "Remote Debugging connects two of Microsoft's most powerful technologies, the Azure cloud and Visual Studio. It allows user to connect to the deployed website and gain full control. the user can set breakpoints, manipulate memory directly, step through code and even change code path. To facilitate this feature the server has to open certain inbound ports for the Visual Studio remote debugger within the Microsoft Azure App Services web applications configuration. Other than the risks of changing code in the production environment, these ports can also prove to be an entry point for an attacker to try to gain control of the live application. Implementing the principle of least privilege by closing the access to these inbound ports will help in significantly reducing the possibility of a security breach.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1133",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18550003",
        "description": [
            {
                "field_data": "If Cross-Origin Resource Sharing (CORS) allows every resource to access function app, then all the CORS request made to the function app will pass the evaluation criteria i.e. '*'. This setting is equivalent to disabling CORS and would make the function app vulnerable to scripting attacks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the resources from specified domains are allowed to access the function apps, while remediating the user must ensure that none of the domains are missed in the configuration, as it will result in inaccessibility of the function app to the missed domain's resources.",
                "field_type": "impact"
            },
            {
                "field_data": "CORS (Cross-Origin Resource Sharing) is an HTTP feature that enables a function app running under one domain to access resources in another domain. All resources implement a security restriction known as same-origin policy that prevents a web page from calling APIs in a different domain; CORS provides a secure way to allow one domain (the origin domain) to call APIs in another domain. CORS acts as a defence against scripting attacks. It should be configured to restrict function app's access to trusted resources only. Configuring CORS rule with '*' is as good as disabling CORS as this configuration will pass all the CORS request made to access the function app. Allowing all resources to access the function app will enable all the untrusted users to gain access to the data and services being managed by the function app.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002"
        ]
    },
    {
        "unique_identifier": "18550004",
        "description": [
            {
                "field_data": "FTP is a non-secure way to transfer data. When a file is sent using this protocol, the data, username, password and other sensitive informations are shared in plain text, which means a hacker can access this information with little to no effort. Hence, it is recommended to use FTPS (secured FTP) instead of FTP.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control should be performed after ensuring that all the FTP servers have SSL/TLS protocol support available, so that none of the data transmissions with the already existing FTP client gets disturbed.",
                "field_type": "impact"
            },
            {
                "field_data": "FTPS (Secure FTP) is used to enhance security for the function apps as it adds an extra layer of security to the FTP protocol, and helps in complying with the industry standards and regulations such as PCI DSS, HIPAA. With FTP, the transmission of data between the function app and the FTP client is unencrypted, leaving the data vulnerable to being intercepted and read.  Enforcing FTPS-only access for the Azure App Services applications, can guarantee that the encrypted traffic between the function app and the FTP clients cannot be decrypted by malicious actors in case they are able to intercept packets sent across the FTP connection. Hence, it must be ensured that the function apps enforce FTPS-only access to encrypt FTP traffic.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537",
            "T1537"
        ]
    },
    {
        "unique_identifier": "18550005",
        "description": [
            {
                "field_data": "If TLS is not updated to the latest version, then all the bugs related to the older version will persist and will not get patched. Also, the older TLS version might result in the future issues with several third party service providers that have restricted access to connections via older TLS versions.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will upgrade TLS to the latest version, which must be done with caution and it must be ensured that the existing functionalities do not get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "Transport Layer Security (TLS) is a protocol that provides privacy and data integrity between two communicating applications. TLS should be updated to the latest version to comply with the security standards and regulations such as PCI DSS, HIPAA, etc.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537",
            "T1537"
        ]
    },
    {
        "unique_identifier": "18550006",
        "description": [
            {
                "field_data": "If managed identity is not used then the developers will have to store the credentials in the code so that the users can authenticate and access different cloud services, which will increase the overhead of managing and securing the credentials and secrets.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "It is advised to proceed with caution while creating managed identities as if the subscription is to be moved or transferred to another directory, then the managed identities linked to it will not get updated and will have to be re-assigned to the necessary resources.",
                "field_type": "impact"
            },
            {
                "field_data": "A managed identity is used for enhancing the authentication security of the cloud services. In Azure, the managed identities eliminate the need for developers to have to manage credentials by providing an identity for the Azure resource in Azure AD and using it to obtain Azure Active Directory (Azure AD) tokens. These tokens can be used for accessing other resources that are registered with the Azure AD, such as Azure Key Vault. The permission level of these managed identities can be changed using Azure RBAC(Role Based Access Control).",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1087.004"
        ]
    },
    {
        "unique_identifier": "18550008",
        "description": [
            {
                "field_data": "If the Python software is not updated to the latest version, then any security flaw in the version that is being used will remain unpatched, and the function app will not be able to make use of any new functionalities that are present in the latest version.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control from the Azure portal cannot be performed for the function apps having plan type as Consumption(Serverless). Hence, a new function app will have to be created having plan type either premium or App Service, which would incur additional charges.\nAlso, remediation of this control will install the latest version of the Python software, which must be done with caution and it must be ensured that the existing functionalities do not get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "New versions of Python software are released periodically either because of security flaws or to include additional functionality. Using the latest Python version for function apps is recommended to benefit from security fixes, if any, and/or new functionalities of the latest version.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.002"
        ]
    },
    {
        "unique_identifier": "18550009",
        "description": [
            {
                "field_data": "If the Java software is not updated to the latest version, then any security flaw in the version that is being used will remain unpatched, and the function app will not be able to make use of any new functionalities that are present in the latest version.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control from the Azure portal cannot be performed for the function apps having plan type as Consumption(Serverless). Hence, a new function app will have to be created having plan type either premium or App Service, which would incur additional charges\nAlso remediation of this control will install the latest version of the Java software, which must be done with caution and it must be ensured that the existing functionalities do not get impacted.",
                "field_type": "impact"
            },
            {
                "field_data": "New versions of Java software are released periodically either because of security flaws or to include additional functionality. Using the latest Java version for function apps is recommended to benefit from security fixes, if any, and/or new functionalities of the latest version.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.002"
        ]
    },
    {
        "unique_identifier": "18560001",
        "description": [
            {
                "field_data": "If the service-managed key is used instead of a customer-managed key for encrypting the Azure Cosmos DB account then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the service-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the customer-managed keys in the key vault are used for encryption of data at rest in an Azure Cosmos DB account, but the keys must be kept securely and should not be deleted as the loss of keys would result in the loss of data.",
                "field_type": "impact"
            },
            {
                "field_data": "In an Azure Cosmos DB account, by default, the data is encrypted at rest with service-managed keys (Transparent to the application and are managed by Microsoft), but customer-managed keys (Customer controls keys via Azure key vault) are commonly required to meet regulatory compliance standards. Customer-managed keys enables a customer to encrypt the data with an Azure key vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management. Hence, it is recommended to use customer-managed keys to manage the encryption at rest of the Azure Cosmos DB data.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1119",
            "T1565.001"
        ]
    },
    {
        "unique_identifier": "18560002",
        "description": [
            {
                "field_data": "If the firewall rules are not configured for the Azure Cosmos DB accounts, then by default, it will accept requests from any source (including the public internet). This would compromise the confidentiality of the Azure Cosmos DB accounts as any unauthorized user can brute-force into these accounts and gain access to the information stored in them.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will configure the firewall rules for the Azure Cosmos DB acconts, which would result in the denial of all the requests made to the Azure Cosmos DB account from any unallowed IP address/range. Also, the browsing of Azure Cosmos DB resources from the portal will be blocked.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Cosmos DB accounts should be configured to deny access to traffic from all unauthorized networks, including the public Internet. The access to the Azure Cosmos DB accounts should be granted only to specific Azure virtual networks that allows a secure network boundary for specific applications, or to public IP addresses/IP address ranges which can enable connections from trusted Internet services and on-premises networks. Once the firewall rules are properly configured, only clients and applications from allowed networks and/or IPs can access the Azure Cosmos DB account resources.\n\nNote: Making changes to the network firewall rules can impact the applications' ability to connect to the Cosmos DB account. Make sure to grant access to any trusted service or network using network rules or IP addresses/ranges before configuring the firewall default rule to deny access.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098.001",
            "T1087.004",
            "T1205",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18580001",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs in Event Hub, one will not be able to diagnose actions and operations responsible for any security incidents within Event Hub, which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for Event Hub, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Event Hub is an event capturing service and a big data streaming platform. It is capable of processing millions of events per second and can easily connect millions of devices across platforms. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. Enabling these logs will help in capturing well-provided information about all the actions and operations that take place under the Event Hub. Thus, it is recommended to enable logging for Event Hub.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1538",
            "T1069.003"
        ]
    },
    {
        "unique_identifier": "18590001",
        "description": [
            {
                "field_data": "If the backup and restore option for the Azure Database for MariaDB is not set to geo-redundant, then local-redundant backup will be created and in case of a region failure the organisation would end up losing the data of the actual resource as well as its backup.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control cannot be performed on an already provisioned server. Hence, if it is required to move the backup storage from locally redundant storage to geo-redundant storage, then the only supported option is to create a new Azure Database for MariaDB and migrate the data using dump and restore. The overall migration and selecting geo-redundant option during new database creation would incur additonal costs as compared to when local-redundant option is selected.",
                "field_type": "impact"
            },
            {
                "field_data": "Backup and restore are an essential part of a business continuity strategy because it protects the data from accidental corruption or deletion. Azure Database for MariaDB allows us to set the backup and restore option for the database server to either geo-redundant or locally redundant storage. Setting the backup and restore option to geo-redundant backup storage will allow the data to be stored not only within the region in which the server is hosted, but also will replicate it to a paired region to provide recovery options in case of a region failure. Also, the configuration of locally redundant or geo-redundant storage for backup is only allowed at the time of creation of server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18590002",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Azure Database for MariaDB, then the only way to access the resources is through the public endpoint. This will expose the server to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the server's private endpoint, hence it must be ensured that all the Azure resources dependent on the Azure Database for MariaDB are configured to be able to access the database server through this private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity to Azure Database for MariaDB. It is recommended to configure a private endpoint connection for Azure Database for MariaDB, to enable access to traffic coming only from known networks and prevent access from all other IP addresses, including within Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18590003",
        "description": [
            {
                "field_data": "If public network access to Azure Database for MariaDB is enabled, then the accessibility of the database will be increased thereby exposing the server to attacks such as man-in-the-middle, credentials bruteforce, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Azure Database for MariaDB. The only way to access the database will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Azure Database for MariaDB should be disabled, this will improve security and will ensure that the data is only accessible from a private endpoint. Setting this configuration will strictly disable access from any public address space outside of Azure IP range, and will deny all logins that match IP or virtual network-based firewall rules.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18600001",
        "description": [
            {
                "field_data": "If the backup and restore option for the Azure Database for PostgreSQL is not set to geo-redundant, then local-redundant backup will be created and in case of a region failure the organisation would end up losing the data of the actual resource as well as its backup.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control cannot be performed on an already provisioned server. Hence, if it is required to move the backup storage from locally redundant storage to geo-redundant storage, then the only supported option is to create a new Azure Database for PostgreSQL and migrate the data using dump and restore. The overall migration and selecting geo-redundant option during new database creation would incur additonal costs as compared to when local-redundant option is selected.",
                "field_type": "impact"
            },
            {
                "field_data": "Backup and restore are an essential part of a business continuity strategy because it protects the data from accidental corruption or deletion. Azure Database for PostgreSQL allows us to set the backup and restore option for the database server to either geo-redundant or locally redundant storage. Setting the backup and restore option to geo-redundant backup storage will allow the data to be stored not only within the region in which the server is hosted, but also will replicate it to a paired region to provide recovery options in case of a region failure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18600002",
        "description": [
            {
                "field_data": "If SSL connections are not enabled on the Azure Database for PostgreSQL server, then any transmission of data between the server and the client application will be unencrypted making it vulnerable to the man-in-the-middle attack.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only secure connections can access the Azure Database for the PostgreSQL server. However, before enforcing this configuration, it must be ensured that there isn't any existing client application that does not support SSL, as in that case, the application will fail to connect to the database server.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Database for PostgreSQL supports connecting the Azure Database for PostgreSQL server to a client applications using Secure Sockets Layer (SSL). Enforcing SSL connections between the database server and the client applications helps protect against 'man-in-the-middle' attacks by encrypting the data stream between the server and the application. This configuration enforces that SSL is always enabled for accessing the database server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1071.001",
            "T1071"
        ]
    },
    {
        "unique_identifier": "18600003",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Azure Database for PostgreSQL, then the only way to access this resource would be through the public endpoint. This will expose the server to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the server's private endpoint, hence it must be ensured that all the Azure resources dependent on the Azure Database for PostgreSQL are configured to be able to access the database server through this private endpoint. Creating a new private endpoint would incur additional costs.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity to Azure Database for PostgreSQL. It is recommended to configure a private endpoint connection for Azure Database for PostgreSQL, to enable access to traffic coming only from known networks and prevent access from all other IP addresses, including within Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18600004",
        "description": [
            {
                "field_data": "If public network access to Azure Database for PostgreSQL is enabled, then the accessibility of the database will be increased thereby exposing the server to attacks such as man-in-the-middle, credentials bruteforce, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Azure Database for PostgreSQL. The only way to access the database will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Azure Database for PostgreSQL should be disabled to ensure that the database is accessible only via private endpoints. Disabling public access will decrease the accessibility of the database, and thereby enhance its security by making it inaccessible over the internet. Hence, as a best security practice, the public network access to the Azure Database for PostgreSQL should be disabled.\nNote: Disabling the public network access to the Azure Database for PostgreSQL, will also disable the Vnet and firewall rules, but the administrator can opt to retain the Vnet and firewall rules configuration for future.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18600005",
        "description": [
            {
                "field_data": "If the platform-managed key is used instead of a customer-managed key for encrypting the PostgreSQL server then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the platform-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the Azure Database for PostgreSQL, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the database inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Customer-managed keys (created by a customer and stored in the key vault or generated using the Azure key vault's APIs) should be used to manage the encryption at rest of the PostgreSQL servers. By default, the data is encrypted at rest with service-managed keys (transparent to the application and are managed by Microsoft), but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enables a customer to encrypt the data with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18610001",
        "description": [
            {
                "field_data": "If the backup and restore option for the Azure Database for MySQL is not set to geo-redundant, then local-redundant backup will be created and in case of a region failure the organisation would end up losing the data of the actual resource as well as its backup.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control cannot be performed on an already provisioned server. Hence, if it is required to move the backup storage from locally redundant storage to geo-redundant storage, then the only supported option is to create a new Azure Database for MySQL and migrate the data using dump and restore. The overall migration and selecting geo-redundant option during new database creation would incur additonal costs as compared to when local-redundant option is selected.",
                "field_type": "impact"
            },
            {
                "field_data": "Backup and restore are an essential part of a business continuity strategy because it protects the data from accidental corruption or deletion. Azure Database for MySQL allows us to set the backup and restore option for the database server to either geo-redundant or locally redundant storage. Setting the backup and restore option to geo-redundant backup storage will allow the data to be stored not only within the region in which the server is hosted, but also will replicate it to a paired region to provide recovery options in case of a region failure. Also, the configuration of locally redundant or geo-redundant storage for backup is only allowed at the time of creation of server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1485",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18610002",
        "description": [
            {
                "field_data": "If SSL connections are not enabled on the Azure Database for MySQL server, then any transmission of data between the server and the client application will be unencrypted making it vulnerable to man-in-the-middle attacks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only secure connections can access the Azure Database for the MySQL server. However, before enforcing this configuration, it must be ensured that there isn't any existing client application that does not support SSL, as in that case, the application will fail to connect to the database server.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Database for MySQL supports connecting the Azure Database for MySQL server to client applications using Secure Sockets Layer (SSL). Enforcing SSL connections between the database server and the client applications helps protect against 'man in the middle' attacks by encrypting the data stream between the server and the application. This configuration enforces that SSL is always enabled for accessing the database server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1071.001",
            "T1071"
        ]
    },
    {
        "unique_identifier": "18610003",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Azure Database for MySQL, then the only way to access this resource would be through the public endpoint. . This will expose the server to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the server's private endpoint, hence it must be ensured that all the Azure resources dependent on the Azure Database for MySQL are configured to be able to access the database server through this private endpoint. Creating a new private endpoint would incur additional costs.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity to Azure Database for MySQL. It is recommended to configure a private endpoint connection for Azure Database for MySQL, to enable access to traffic coming only from known networks and prevent access from all other IP addresses, including within Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18610004",
        "description": [
            {
                "field_data": "If public network access to Azure Database for MySQL is enabled, then the database server will be accessible over the internet. This will provide an entry point for an intruder to perform attacks such as man-in-the-middle, eavesdropping, brute-forcing, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Azure Database for MySQL. The only way to access the database will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Azure Database for MySQL should be disabled to ensure that the database is accessible only via private endpoints. Disabling public access will decrease the accessibility of the database, and thereby enhance its security by making it inaccessible over the internet. Hence, as a best security practice, the public network access to the Azure Database for MySQL should be disabled.\nNote: Disabling the public network access to the Azure Database for MySQL, will also disable the Vnet and firewall rules, but the administrator can opt to retain the Vnet and firewall rules configuration for future.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "18610005",
        "description": [
            {
                "field_data": "If the platform-managed key is used instead of a customer-managed key for encrypting the MySQL server then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the platform-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the Azure Database for MySQL, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the database inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Customer-managed keys (created by a customer and stored in the key vault or generated using the Azure key vault's APIs) should be used to manage the encryption at rest of the MySQL servers. By default, the data is encrypted at rest with service-managed keys (transparent to the application and are managed by Microsoft), but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enables a customer to encrypt the data with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18620001",
        "description": [
            {
                "field_data": "If a Web Application Firewall is not enabled on an Application Gateway, then a malicious internet user or a bot can target the backend application with exploits for known vulnerabilities. A successful exploitation may result into the unauthorized access to data or the underlying server thereby affecting the data confidentiality and integrity.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable the Web Application Firewall for Application Gateway to restrict access to the web applications, but enabling WAF directly in the prevention mode might result in the blocking of traffic from authorized resources. Hence, WAF should first be enabled in the detection mode and its rules should be monitored via the logs, to select the correct set of rules that should be enabled for blocking the incoming traffic in the prevention mode.",
                "field_type": "impact"
            },
            {
                "field_data": "An Application Gateway is a web traffic load balancer that enables us to manage traffic to the web application. A Web Application Firewall (WAF) should be enabled for Application Gateway to provide centralized protection of the web applications from common exploits and vulnerabilities such as SQL injections, Cross-Site Scripting, local and remote file executions. WAF, if enabled will also restrict access to the web applications by countries, IP address ranges, and other http(s) parameters via custom rules.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098.001",
            "T1087.004",
            "T1205",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18630001",
        "description": [
            {
                "field_data": "If a Web Application Firewall is not enabled on an Application Gateway, then a malicious internet user or a bot can target the backend application with exploits for known vulnerabilities. A successful exploitation may result into the unauthorized access to data or the underlying server thereby affecting the data confidentiality and integrity.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable the Web Application Firewall for Application Gateway to restrict access to the web applications, but enabling WAF directly in the prevention mode might result in the blocking of traffic from authorized resources. Hence, WAF should first be enabled in the detection mode and its rules should be monitored via the logs, to select the correct set of rules that should be enabled for blocking the incoming traffic in the prevention mode.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Front Door Service is a global, scalable entry-point that uses the Microsoft global edge network to build highly scalable web applications. Azure Web Application Firewall (WAF) on Azure Front Door Service provides centralized protection for the web application by inspecting every incoming traffic. WAF defends the web services against common exploits and vulnerabilities such as SQL injections, Cross-Site Scripting, local and remote file executions, etc. With WAF enabled, one can also restrict access to the web applications by countries, IP address ranges, and other http(s) parameters via custom rules.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1098.001",
            "T1087.004",
            "T1205",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18640001",
        "description": [
            {
                "field_data": "If HTTP is used with the API App for integrating with the cloud applications, then data will be transmitted in plain text thereby increasing the chances for an attacker to steal the sensitive information via network layer attacks such as man-in-the-middle, eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only secure connections can access the API App. However, before enabling only HTTPS access for the API App, it must be ensured that there isn't any existing resource that can only access the API App over HTTP.",
                "field_type": "impact"
            },
            {
                "field_data": "API Apps are the Azure App Service that offers a rich platform and ecosystem for building, consuming, and distributing APIs in the cloud and on-premises. A client can connect to the cloud applications such as Office 365, SalesForce, Dynamics, OneDrive, Box, DropBox, Twilio, Twitter, Facebook, Marketo, etc via the API App by using both HTTP (data is not encrypted and is transmitted in plain text) or HTTPS (data is encrypted and transmitted securely via SSL/TLS protocols). It is recommended to use HTTPS, as it will protect the data in transit from being intercepted and tampered with by attackers.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1071.001",
            "T1071"
        ]
    },
    {
        "unique_identifier": "18640002",
        "description": [
            {
                "field_data": "If managed identity is not used then the developers will have to store the credentials in the code so that the users can authenticate and access different cloud services, which will increase the overhead of managing and securing the credentials and secrets.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If the subscription is to be moved or transferred to another directory, then the managed identities linked to it will not get updated and will have to be re-assigned to the necessary resources.",
                "field_type": "impact"
            },
            {
                "field_data": "A managed identity is used for enhancing the authentication security of the cloud services. In Azure, the managed identities eliminate the need for developers to have to manage credentials by providing an identity for the Azure resource (API App) in Azure AD and using it to obtain Azure Active Directory (Azure AD) tokens. These tokens can be used for accessing other resources that are registered with the Azure AD, such as Azure Key Vault. The permission level of these managed identities can be changed using Azure RBAC(Role Based Access Control).",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1087.004"
        ]
    },
    {
        "unique_identifier": "18640003",
        "description": [
            {
                "field_data": "FTP is a non-secure way to transfer data. When a file is sent using this protocol, the data, username, password and other sensitive informations are shared in plain text, which means a hacker can access this information with little to no effort. Hence, it is recommended to use FTPS(secured FTP) instead of FTP.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control should be performed after ensuring that all the FTP servers have SSL/TLS protocol support available, so that none of the data transmissions with the already existing FTP client gets disturbed.",
                "field_type": "impact"
            },
            {
                "field_data": "FTPS (Secure FTP) is used to enhance security for the API Apps in Azure, by adding an extra layer of security to the FTP protocol, and thereby helping in complying with the industry standards and regulations such as PCI-DSS, HIPAA. With FTP, the transmission of data between the API App and the FTP client is unencrypted, leaving the data vulnerable to being intercepted and read. Enforcing FTPS-only access for the Azure App Services applications, can guarantee that the encrypted traffic between the API App servers and the FTP clients cannot be decrypted by malicious actors in case they are able to intercept packets sent across the FTP connection. Hence, it must be ensured that the Azure App Services API Apps enforce FTPS-only access to encrypt FTP traffic.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537",
            "T1537"
        ]
    },
    {
        "unique_identifier": "18640004",
        "description": [
            {
                "field_data": "Without enabling diagnostic logs for apps in App Service, one will not be able to diagnose the runtime failures related to the applications which could have been detected with the help of generated logs.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables logging for the apps in App Service, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "An App Service is a http-based service for developing and hosting web applications, REST APIs, and mobile back ends in any programming language. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. The Diagnostic Logs are logs emitted by a resource and provide insight into the operation of that resource. By enabling diagnostic logs, one can record and store information about the runtime data and events which would help in troubleshooting the application. Thus, it is recommended to enable logging for the App Service.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18640005",
        "description": [
            {
                "field_data": "If Cross-Origin Resource Sharing (CORS) allows every resource to access the API App, then all the CORS request made to the API App will pass the evaluation criteria i.e. '*'. This setting is equivalent to disabling CORS and would make the application vulnerable to scripting attacks.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the resources from specified domains are allowed to access the API apps, while remediating the user must ensure that none of the domains are missed in the configuration, as it will result in inaccessibility of the API App to the missed domain's resources.",
                "field_type": "impact"
            },
            {
                "field_data": "CORS (Cross-Origin Resource Sharing) is an HTTP feature that enables an API App running under one domain to access resources in another domain. All resources implement a security restriction known as same-origin policy that prevents an App Service from calling APIs in a different domain; CORS provides a secure way to allow one domain (the origin domain) to call APIs in another domain. CORS acts as a defence against scripting attacks. It should be configured to restrict API App's access to trusted resources only. Configuring CORS rule with '*' is as good as disabling CORS as this configuration will pass all the CORS request made to access the API app. Allowing all resources to access the API App will enable all the untrusted users to gain access to the data and services being managed by the API App.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1078.002"
        ]
    },
    {
        "unique_identifier": "18640006",
        "description": [
            {
                "field_data": "If remote debugging is enabled on the API App, then the inbound ports used for debugging the API App can be used as an entry point by an attacker to access and exploit all the resources.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will turn off remote debugging for the API App, and user will not be able to remotely debug any issue that arises in any API App after deployment.",
                "field_type": "impact"
            },
            {
                "field_data": "Remote Debugging connects two of Microsoft's most powerful technologies, the Azure cloud and Visual Studio. It allows user to connect to the deployed website and gain full control. the user can set breakpoints, manipulate memory directly, step through code and even change code path. To facilitate this feature the server has to open certain inbound ports for the Visual Studio remote debugger within the Microsoft Azure App Services API App configuration. Other than the risks of changing code in the production environment, these ports can also prove to be an entry point for an attacker to try to gain control of the live application. Implementing the principle of least privilege by closing the access to these inbound ports will help in significantly reducing the possibility of a security breach.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1133",
            "T1205.001"
        ]
    },
    {
        "unique_identifier": "18640007",
        "description": [
            {
                "field_data": "If TLS is not updated to the latest version, then all the bugs related to the older version will persist and will not get patched. Also, the older TLS version might result in the future issues with several third party service providers that have restricted access to connections via older TLS versions.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will upgrade TLS to the latest version, which must be done with caution and it must be ensured that the existing users are not refrained from accessing the API App.",
                "field_type": "impact"
            },
            {
                "field_data": "Transport Layer Security (TLS) is a protocol that provides privacy and data integrity between two communicating applications. TLS helps in validating the client certificate and authenticating the requests made to the API App by the client over HTTPS. Hence, it is recommended to use the latest version of TLS to comply with the regulatory standards such as PCI-DSS, HIPAA, etc.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537",
            "T1537"
        ]
    },
    {
        "unique_identifier": "18640009",
        "description": [
            {
                "field_data": "Periodically, newer versions are released for Java either due to security flaws or to include additional functionality. Using the latest Java version for API apps is recommended to benefit from security fixes, if any, and/or new functionalities of the latest version.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18640010",
        "description": [
            {
                "field_data": "Periodically, newer versions are released for PHP software either due to security flaws or to include additional functionality. Using the latest PHP version for API apps is recommended to benefit from security fixes, if any, and/or new functionalities of the latest version.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "18640011",
        "description": [
            {
                "field_data": "Periodically, newer versions are released for Python software either due to security flaws or to include additional functionality. Using the latest Python version for API apps is recommended to benefit from security fixes, if any, and/or new functionalities of the latest version.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1191"
        ]
    },
    {
        "unique_identifier": "18730001",
        "description": [
            {
                "field_data": "Without associating NSG rules to the subnets, an attacker might attempt to perform lateral movement in that subnet through a subset of an unwanted traffic, thereby making all the resources in the subnet susceptible to network layer attacks such as DDoS, eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will apply NSG rules to the subnets and to all the resources connected to that subnet, which would thereby limit the allowed traffic against the requirement, hence it must be done cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "A Network Security Group (NSG) contains a list of security rules known as Access Control List (ACL), that allow or deny network traffic to resources connected to the subnet. NSGs when associated with the subnets helps in restricting access by applying ACL rules to all the VM instances and integrated services in that subnet, thereby protecting the subnets from potential attacks such as DDoS, credentials bruteforce, Man-in-the-Middle attack, etc.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1046",
            "T1499"
        ]
    },
    {
        "unique_identifier": "18800001",
        "description": [
            {
                "field_data": "If private links are not configured for the event grid topic, then the only way to access the event grid topic will be through the public IP addresses. This will expose the event grid topic to network layer attacks such as DDoS, man-in-the-middle, etc, as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the event grid topic's private endpoint, hence it must be ensured that all the Azure resources dependent on the event grid topic are configured to be able to access it through the private endpoints.",
                "field_type": "impact"
            },
            {
                "field_data": "The private links in Azure helps in connecting the virtual network to Azure services without a public IP address at the source or destination. Network traffic between the clients on the virtual network and the event grid topic's private endpoints traverses the virtual network and a private link on the Microsoft backbone network, eliminating exposure from the public internet. By mapping private endpoints to the event grid topic instead of the entire service, the content will also be protected against data leakage risks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537"
        ]
    },
    {
        "unique_identifier": "18810001",
        "description": [
            {
                "field_data": "If private links are not configured for the event grid domain, then the only way to access the event grid domain will be through the public IP addresses. This will expose the event grid domain to network layer attacks such as DDoS, man-in-the-middle, etc, as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the event grid domain's private endpoint, hence it must be ensured that all the Azure resources dependent on the event grid domain are configured to be able to access it through the private endpoints.",
                "field_type": "impact"
            },
            {
                "field_data": "The private links in Azure helps in connecting the virtual network to Azure services without a public IP address at the source or destination. Network traffic between the clients on the virtual network and the event grid domain's private endpoints traverses the virtual network and a private link on the Microsoft backbone network, eliminating exposure from the public internet. By mapping private endpoints to the event grid domain instead of the entire service, the content will also be protected against data leakage risks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1040",
            "T1498",
            "T1499",
            "T1565",
            "T1133"
        ]
    },
    {
        "unique_identifier": "18850001",
        "description": [
            {
                "field_data": "If private links are not configured for App Configuration, then any attacker will be able to gain access to the App Configuration's details from malicious public IP addresses or domains, without getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control can only be performed for the App Configurations having Standard pricing tier. Also, while remediating it must be ensured that all the Azure resources dependent on the App Configuration are configured to be able to access the store through this private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoints for App Configuration in Azure allows clients on a virtual network (VNet) to securely access data over a private link. The private endpoint uses an IP address from the VNet address space for the App Configuration store. Network traffic between the clients on the VNet and the App Configuration store traverses over the VNet using a private link on the Microsoft backbone network, eliminating exposure to the public internet. Mapping of private endpoints to the App Configuration instances instead of the entire service, also helps in protecting against data leakage risks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537"
        ]
    },
    {
        "unique_identifier": "18860001",
        "description": [
            {
                "field_data": "If private links are not configured for Azure SignalR Service, then any attacker will be able to gain access to the Azure SignalR Service's details from malicious public IP addresses or domains, without getting detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control can only be performed for those Azure SignalR Services that have a Standard pricing tier. Also, while remediating it must be ensured that all the Azure resources dependent on the Azure SignalR Service are configured to be able to access it through the private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoints for Azure SignalR Service allows clients on a virtual network (VNet) to securely access data over a Private Link. The private endpoint uses an IP address from the VNet address space for the Azure SignalR Service. Network traffic between the clients on the VNet and Azure SignalR Service traverses over a private link on the Microsoft backbone network, eliminating exposure from the public internet. Mapping of private endpoints to the Azure SignalR Service resource instead of the entire service, also helps in protecting against data leakage risks.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1537"
        ]
    },
    {
        "unique_identifier": "18880001",
        "description": [
            {
                "field_data": "Azure Spring Cloud instance if not deployed inside a virtual network exposes it to be accessed by internet users. A malicious user can perform attacks such as brute-force and gain access to the Azure Spring Cloud apps and services.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control deploys an Azure Spring Cloud instance inside a virtual network (VNet injection) and this feature is only supported in the Standard tier of the Azure Spring Cloud. Also, the virtual network can be slected for the Azure Spring Cloud service instance only at the time of creation and cannot be changed later.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Spring Cloud instance when deployed in a virtual network enables isolation of Azure Spring Cloud apps and services from the internet, enables Azure Spring Cloud to interact with systems in either on premises data centers or Azure service in other virtual networks, and empowers customers to control inbound and outbound network communications for Azure Spring Cloud.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1557"
        ]
    },
    {
        "unique_identifier": "18890001",
        "description": [
            {
                "field_data": "If the Diagnostic Logs are not enabled for Azure Data Lake Analytics then in case of a security incident no activity trails will be generated and hence it would be difficult to investigate the incident.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable diagnostic logging of the Azure Data Lake Analytics, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Data Lake Analytics is an on-demand analytics job service that simplifies big data. The Diagnostic Logs in Azure are the logs emitted by a resource and provide an insight into the operation of that resource. Enabling diagnostic logging for Azure Data Lake Analytics helps in collecting the access audit trails, that provide information about the list of users that accessed the data, frequency of accessing the data, how much data is stored in the account, etc.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18900001",
        "description": [
            {
                "field_data": "If the Diagnostic Logs are not enabled for Azure Data Lake Store then in case of a security incident no activity trails will be generated and hence it would be difficult to investigate the incident.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will enable diagnostic logging of the Azure Data Lake Store, which may incur additional costs to store or process diagnostic log data.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Data Lake Store is a cloud platform that provides scalable, cost-effective storage for big data analytics. The Diagnostic Logs in Azure are the logs emitted by a resource and provide an insight into the operation of that resource. Enabling diagnostic logging for Azure Data Lake Store helps in collecting the access audit trails, that provide information about the list of users that accessed the data, frequency of accessing the data, how much data is stored in the account, etc.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1110.004",
            "T1552.004",
            "T1538",
            "T1069.003",
            "T1185"
        ]
    },
    {
        "unique_identifier": "18910001",
        "description": [
            {
                "field_data": "Without a vulnerability assessment solution installed, a number of open vulnerabilities like remote cloud execution (an action which involves an attacker executing code remotely using system vulnerabilities) can go undetected which can double up as openings for an attacker to gain access to the operations of a SQL managedinstances remotely and make breaking changes.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control enables a built-in vulnerability assessment solution and also provides other thrid party vulnerability assessment scanners, the usage of which may require licensing and incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability assessment scanner works by deploying various assessment extensions on the SQL managed instance, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings to Security Center. Thereby, helping in the discovery, tracking and remediation of potential vulnerabilities. Hence, it is recommended to install a vulnerability assessment solution (included with Azure Defender) to enable a best of breed vulnerability assessment solution on the SQL managed instances.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190",
            "T1046",
            "T1210"
        ]
    },
    {
        "unique_identifier": "18910002",
        "description": [
            {
                "field_data": "If Azure Defender for SQL is not enabled on the SQL managed instances then we will not be able to detect anomalous database access patterns and mitigate potential database vulnerabilities such as SQL injection, password bruteforce attacks, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for protecting all the SQL databases on the SQL managed instance, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for SQL is a unified package that provides advanced SQL security capabilities.  It includes functionality for surfacing and mitigating potential database vulnerabilities, detecting anomalous activities that could indicate a threat to the database, and discovering and classifying sensitive data.\nImportant: The cost of Azure Defender is aligned with Azure Security Center standard tier pricing per managed instance. You are thus paying only once for protecting all databases on the managed instance with Azure Defender.\n(Related policy: Advanced data security should be enabled on SQL Managed Instance)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499",
            "T1499.002",
            "T1499.003",
            "T1499.004"
        ]
    },
    {
        "unique_identifier": "18910003",
        "description": [
            {
                "field_data": "If the platform-managed key is used instead of a customer-managed key for encrypting the SQL managed instances then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the platform-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the SQL managed instance in Azure, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the database inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Implementing Transparent Data Encryption (TDE) with customer-managed key enables Bring Your Own Key (BYOK) scenario for data protection at rest, and allows organizations to implement separation of duties in the management of keys and data. With customer-managed transparent data encryption the data is encrypted with a customer-managed asymmetric key (TDE protector) stored in the customer-owned Azure Key Vault. Also, the customer is responsible for and in a full control of the key lifecycle management (key creation, upload, rotation, deletion), key usage permissions, and auditing of operations on keys.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "18910004",
        "description": [
            {
                "field_data": "Vulnerability assessment can discover, track, and help you remediate potential database vulnerabilities.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190",
            "T1552"
        ]
    },
    {
        "unique_identifier": "19260001",
        "description": [
            {
                "field_data": "API Management service, if not deployed inside a virtual network will make it accessible over the internet. The attackers will be able to access these services through the use of malicious IP addresses or public endpoints without being detected.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the API Management service is not accessible publicly. However, while deploying an API Management service to a Resource Manager virtual network, the service must be in a dedicated subnet that contains no other resources except for instances of the API Management service. If an attempt is made to deploy an Azure API Management service to a Resource Manager virtual network subnet that contains other resources, the deployment will fail.",
                "field_type": "impact"
            },
            {
                "field_data": "API Management services are used for creating consistent and modern API gateways for existing back-end services. The virtual network deployment of the API Management services provides enhanced security, isolation and allows us to place these services in a non-internet routable network to which the access can be controlled. These networks can then be connected to the on-premises networks using various VPN technologies, which enables access to the backend services within the network and/or on-premises. The developer portal and API gateway, can be configured to be accessible either from the Internet or only within the virtual network.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1557"
        ]
    },
    {
        "unique_identifier": "19270001",
        "description": [
            {
                "field_data": "If the Microsoft-managed key is used instead of a customer-managed key for encrypting the data in the Cognitive Services, then the key's creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the Microsoft-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the data in the Cognitive Services account, but both the Key-Vault and the key used for encryption must not get deleted or expired, as this will make the Cognitive Services account inaccessible.",
                "field_type": "impact"
            },
            {
                "field_data": "Customer-managed keys (created by a customer and stored in the key vault or generated using the Azure key vault's APIs) should be used to manage the encryption at rest of the Cognitive Services account. By default, the data is encrypted at rest with service-managed keys (transparent to the application and are managed by Microsoft), but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enables a customer to encrypt the data stored in Cognitive Services with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "19270002",
        "description": [
            {
                "field_data": "If access to Cognitive Services account is not restricted by the virtual network rules, then any attacker will be able to gain access to the data present in these accounts from malicious IP addresses or domains without getting detected. This would thereby make the Cognitive Services accounts susceptible to other network layer attacks such as DDoS, Eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If the access to the Cognitive Services account is restricted by configuring the virtual network rules, then any incoming request other than the one originating from any service that is operating within an Azure virtual network or an allowed IP address, will be blocked. Hence, it must be exercised cautiously so that all the trusted resources and services are able to access the data present in the Cognitive Services accounts.",
                "field_type": "impact"
            },
            {
                "field_data": "Network access to Cognitive Services accounts should be restricted by configuring network rules so that only applications from allowed networks are able to access the Cognitive Services account. To allow connections from specific internet or on-premises clients, access can be granted to traffic from specific Azure virtual networks or to public internet IP address ranges.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "19270003",
        "description": [
            {
                "field_data": "If public network access to the Cognitive Services account is enabled, then the accessibility of these accounts will increase. This would thereby expose the Cognitive Services accounts to several network attacks such as DDoS, Eavesdropping, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Cognitive Services accounts. The only way to access these accounts will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Cognitive Services accounts should be disabled to ensure that the data stored in these accounts is accessible only via private endpoints. Disabling public access will decrease the accessibility of the data, and thereby enhance its security by making it inaccessible over the internet. Hence, as a best security practice, the public network access to the Cognitive Services account should be disabled.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "19270004",
        "description": [
            {
                "field_data": "Without enabling data encryption for the Cognitive Services account, all the information present in these accounts will be stored in plain-text form. Hence, in case of a compromise, an attacker will have complete access to the data stored in these accounts and use it for any unauthorized purpose.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that any new data stored in the Cognitive Services account is encrypted, also, all the existing files will be retroactively encrypted by a background encryption process.",
                "field_type": "impact"
            },
            {
                "field_data": "Cognitive Services account with storage, should enable data encryption with either Customer managed or Microsoft managed key.  By default, every subscription uses Microsoft managed encryption keys, but if the pricing tier supports Customer managed keys, then a customer can select between the encryption types for encrypting the Cognitive Services account.\n\nNote: In case of Customer managed key both Soft Delete and Do Not Purge properties on the key vault must be enabled, also, RSA keys of size 2048 must be used for encryption.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "19280001",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Machine Learning workspaces in Azure, then the only way to access this resource would be through the public endpoint. This will expose the server to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using the private endpoint, hence it must be ensured that all the Azure resources dependent on the Machine Learning workspaces are configured to be able to access it through this private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "In Azure, private endpoints helps in connecting the virtual network to the Azure services without the public IP address at the source or destination. By configuring the private endpoints for the Machine Learning workspace, the connectivity between the consumer and services are handled over the Azure backbone network. It is recommended to configure a private endpoint connection for Machine Learning workspaces in Azure, to enable access to traffic coming only from known networks and prevent access from all other IP addresses.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "19280002",
        "description": [
            {
                "field_data": "If the Microsoft-managed key is used instead of a customer-managed key for encrypting the data stored in Machine Learning workspaces then the key creation, storage, rotation, and lifecycle will all be managed by Microsoft. This key management policy may not be in adherence to the global/state regulatory requirements. Additionally, the Microsoft-managed keys does not provide audit logs as well as fine grained controls over the key access, thereby any misuse of this key may go unnoticed.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that customer-managed keys are used for encrypting the Machine Learning workspaces. The Key Vault must be in the same region as that of the workspace, else the deployment will fail.",
                "field_type": "impact"
            },
            {
                "field_data": "Customer-managed keys (created by a customer and stored in the key vault or generated using the Azure key vault's APIs) should be used to manage the encryption at rest of the data stored in Machine Learning workspace. By default, the data is encrypted at rest with service-managed keys (transparent to the application and are managed by Microsoft), but customer-managed keys are commonly required to meet regulatory compliance standards. Customer-managed keys enables a customer to encrypt the data with an Azure Key Vault key that is created and owned by them. Also, the customer has full control and responsibility for the key lifecycle, including rotation and management.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1565.002",
            "T1565"
        ]
    },
    {
        "unique_identifier": "19290001",
        "description": [
            {
                "field_data": "Without installing Log Analytics agent, it will not be possible to collect logs and performance data from Azure Arc machines and send it to a Log Analytics workspace to take advantage of features supported by Azure Monitor Logs such as log queries where the logs can be analyzed together using a sophisticated query language that's capable of quickly analyzing millions of records, which can bring out critical patterns (like resource usage insights, protocol failures, network outages etc) in your monitoring data with the help of which the organization can solve detected problems as quickly as possible or prevent them before they happen.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control installs Log Analytics agent, which will not have any impact, however the collected data cannot be sent to the Azure Monitor Metrics, Azure Storage, or Azure Event Hubs.",
                "field_type": "impact"
            },
            {
                "field_data": "The Log Analytics agent collects monitoring data from the guest operating system and workloads of virtual machines in Azure, other cloud providers, and on-premises and sends that data into a Log Analytics workspace. It is used by Azure Monitor, Azure Security Center, and Azure Sentinel, among other Azure management solutions. Security Center uses the Log Analytics agent (also known as Microsoft Monitoring Agent (MMA)) to collect security events from the Azure Arc machines.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1578",
            "T1072"
        ]
    },
    {
        "unique_identifier": "19440002",
        "description": [
            {
                "field_data": "If auditing is not enabled for SQL servers then any activity being performed by an unauthorized user on the SQL server will go undetected, as no audit logs will be generated to re-trace the activity.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that the audit logs are generated for the SQL server, but during very high activity, or high network load, SQL database in Azure will allow operations to proceed and may not record some audited events.",
                "field_type": "impact"
            },
            {
                "field_data": "Auditing for SQL servers in Azure helps in tracking the activities across all databases on the server and writing them to an audit log in the Azure storage account, Log Analytics workspace, or Event Hubs. This would help in maintaining the regulatory compliance and gaining insight into the discrepancies and anomalies that could indicate business concerns or suspected security violations.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1195.001"
        ]
    },
    {
        "unique_identifier": "19440003",
        "description": [
            {
                "field_data": "The vulnerabilities reported during the vulnerability assessment by tools such as Azure Defender may lead to unauthorized access to data stored in the SQL database, which may thereby impact the confidentiality, integrity, or availability of the consumer application and the organization.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control removes reported vulnerabilities, which must be exercised with caution.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability scanner works by deploying various assessment extensions on the SQL databse, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings which includes any deviations from best practices such as misconfigurations, excessive permissions, and unprotected sensitive data to the Security Center. However, all the vulnerability findings must be remediated to get the full benefit of Vulnerability assessment solution to secure the SQL database.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190"
        ]
    },
    {
        "unique_identifier": "19440004",
        "description": [
            {
                "field_data": "Without a vulnerability assessment solution installed, a number of open vulnerabilities like remote cloud execution (an action which involves an attacker executing code remotely using system vulnerabilities) can go undetected which can double up as openings for an attacker to gain access to the operations of a SQL server remotely and make breaking changes.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediating this control enables a built-in vulnerability assessment solution and also provides other thrid party vulnerability assessment scanners, the usage of which may require licensing and incur additional charges.",
                "field_type": "impact"
            },
            {
                "field_data": "A core component of every cyber risk and security program is the identification and analysis of vulnerabilities. The vulnerability assessment scanner works by deploying various assessment extensions on the SQL server, then it gathers information by collecting artifacts and sending them to the cloud services, which conducts the vulnerability assessments over it and sends its findings to Security Center. Thereby, helping in the discovery, tracking and remediation of potential vulnerabilities. Hence, it is recommended to install a vulnerability assessment solution (included with Azure Defender) to enable a best of breed vulnerability assessment solution on the SQL server.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1190",
            "T1046",
            "T1210"
        ]
    },
    {
        "unique_identifier": "19440005",
        "description": [
            {
                "field_data": "If Azure Defender for SQL is not enabled on the SQL server then we will not be able to detect anomalous database access patterns and mitigate potential database vulnerabilities such as SQL injection, password bruteforce attacks, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "If Azure Defender is enabled for protecting SQL on the SQL server, then additional charges will be incurred.",
                "field_type": "impact"
            },
            {
                "field_data": "Azure Defender for SQL is a unified package that provides advanced SQL security capabilities.  It includes functionality for surfacing and mitigating potential database vulnerabilities, detecting anomalous activities that could indicate a threat to the database, and discovering and classifying sensitive data.\nImportant: Remediating this recommendation will result in charges for protecting the Azure SQL Database servers. If you don't have any Azure SQL Database servers in the subscription, no charges will be incurred. If you create any Azure SQL Database servers on this subscription in the future, they will automatically be protected and charges will begin at that time.\n(Related policy: Advanced data security should be enabled on your SQL servers)",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1499",
            "T1499.002",
            "T1499.003",
            "T1499.004"
        ]
    },
    {
        "unique_identifier": "19440007",
        "description": [
            {
                "field_data": "If public network access to Azure SQL Database is enabled, then the accessibility of the database will be increased thereby exposing it to attacks such as man-in-the-middle, credentials bruteforce, etc.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will deny any public IP address from accessing the Azure SQL Database. The only way to access the database will be through the private endpoint, hence public network access must be disabled cautiously.",
                "field_type": "impact"
            },
            {
                "field_data": "The public network access to Azure SQL Database should be disabled to ensure that the database is accessible only via the private endpoints. Disabling public access will decrease the accessibility of the database, and thereby enhance its security by making it inaccessible over the internet. Hence, as a best security practice, the public network access to the Azure SQL Database should be disabled.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "19440008",
        "description": [
            {
                "field_data": "If the private endpoint is not enabled for Azure SQL Database, then the only way to access the resources is through the public endpoint. This will expose the database to attacks such as man-in-the-middle, credential bruteforce, etc. as it will be accessible over the internet.",
                "field_type": "businessDescription"
            },
            {
                "field_data": "Remediation of this control will ensure that only the configured resources in Azure are able to communicate using IP of the SQL server's private endpoint, hence it must be ensured that all the Azure resources dependent on the Azure SQL Database are configured to be able to access the database server through this private endpoint.",
                "field_type": "impact"
            },
            {
                "field_data": "Private endpoint connections enforce secure communication by enabling private connectivity to Azure SQL Database. It is recommended to configure a private endpoint connection for Azure SQL Database, to enable access to traffic coming only from known networks and prevent access from all other IP addresses, including within Azure.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1530",
            "T1530"
        ]
    },
    {
        "unique_identifier": "21800001",
        "description": [
            {
                "field_data": "It is important to enable encryption of Automation account variable assets when storing sensitive data.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1552"
        ]
    },
    {
        "unique_identifier": "21808001",
        "description": [
            {
                "field_data": "Service Fabric provides three levels of protection (None, Sign and EncryptAndSign) for node-to-node communication using a primary cluster certificate. Set the protection level to ensure that all node-to-node messages are encrypted and digitally signed.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1040"
        ]
    },
    {
        "unique_identifier": "21808002",
        "description": [
            {
                "field_data": "Perform Client authentication only via Azure Active Directory in Service Fabric",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1552"
        ]
    },
    {
        "unique_identifier": "21809001",
        "description": [
            {
                "field_data": "Protect your subnet from potential threats by restricting access to it with a network security group (NSG). NSGs contain a list of Access Control List (ACL) rules that allow or deny network traffic to your subnet. When an NSG is associated with a subnet, the ACL rules apply to all the VM instances and integrated services in that subnet, but don't apply to internal traffic inside the subnet. To secure resources in the same subnet from one another, enable NSG directly on the resources as well.\nNote that the following subnet types will be listed as not applicable: GatewaySubnet, AzureFirewallSubnet, AzureBastionSubnet.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1021",
            "T1046",
            "T1048",
            "T1095",
            "T1199",
            "T1219",
            "T1482",
            "T1498",
            "T1499",
            "T1571",
            "T1602",
            "T1133"
        ]
    },
    {
        "unique_identifier": "21810001",
        "description": [
            {
                "field_data": "The Guest Configuration extension requires a system assigned managed identity. Azure virtual machines in the scope of this policy will be non-compliant when they have the Guest Configuration extension installed but do not have a system assigned managed identity. Learn more: https://aka.ms/gcpol",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1552"
        ]
    },
    {
        "unique_identifier": "21811001",
        "description": [
            {
                "field_data": "Audit VM Image Builder templates that do not have a virtual network configured. When a virtual network is not configured, a public IP is created and used instead, which may directly expose resources to the internet and increase the potential attack surface.",
                "field_type": "riskDescription"
            }
        ],
        "techniqueMapping": [
            "T1040",
            "T1498",
            "T1499",
            "T1565",
            "T1133"
        ]
    }
]