{
    "id": "T0859",
    "name": "Valid Accounts",
    "x_mitre_is_subtechnique": false,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may steal the credentials of a specific user or service account using credential access techniques. In some cases, default credentials for control system devices may be publicly available. Compromised credentials may be used to bypass access controls placed on various resources on hosts and within the network, and may even be used for persistent access to remote systems. Compromised and default credentials may also grant an adversary increased privilege to specific systems and devices or access to restricted areas of the network. Adversaries may choose not to use malware or tools, in conjunction with the legitimate access those credentials provide, to make it harder to detect their presence or to control devices and send legitimate commands in an unintended way. \n\nAdversaries may also create accounts, sometimes using predefined account names and passwords, to provide a means of backup access for persistence. (Citation: Booz Allen Hamilton) \n\nThe overlap of credentials and permissions across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator)  and possibly between the enterprise and operational technology environments. Adversaries may be able to leverage valid credentials from one system to gain access to another system.",
    "x_mitre_platforms": [
        "Control Server",
        "Data Historian",
        "Engineering Workstation",
        "Field Controller/RTU/PLC/IED",
        "Human-Machine Interface",
        "Input/Output Server",
        "Safety Instrumented System/Protection Relay"
    ],
    "x_mitre_domains": [
        "ics-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "external_id": "T0859",
            "url": "https://attack.mitre.org/techniques/T0859"
        },
        {
            "source_name": "Booz Allen Hamilton",
            "url": "https://www.boozallen.com/content/dam/boozallen/documents/2016/09/ukraine-report-when-the-lights-went-out.pdf",
            "description": "Booz Allen Hamilton   When The Lights Went Out Retrieved. 2019/10/22 "
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-ics-attack",
            "phase_name": "persistence-ics"
        },
        {
            "kill_chain_name": "mitre-ics-attack",
            "phase_name": "lateral-movement-ics"
        }
    ],
    "tactic": [
        "persistence-ics",
        "lateral-movement-ics"
    ],
    "x_mitre_detection": "",
    "x_mitre_data_sources": [
        "Logon Session: Logon Session Creation",
        "User Account: User Account Authentication"
    ],
    "x_mitre_permissions_required": [],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Access Management",
                "description": "Access Management technologies can be used to enforce authorization polices and decisions, especially when existing field devices do not provided sufficient capabilities to support user identification and authentication. (Citation: McCarthy, J et al. July 2018) These technologies typically utilize an in-line network device or gateway system to prevent access to unauthenticated users, while also integrating with an authentication service to first verify user credentials. (Citation: Centre for the Protection of National Infrastructure November 2010)",
                "type": "course-of-action",
                "id": "M0801"
            },
            {
                "name": "Privileged Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root.",
                "type": "course-of-action",
                "id": "M0926"
            },
            {
                "name": "User Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to user accounts.",
                "type": "course-of-action",
                "id": "M0918"
            },
            {
                "name": "Filter Network Traffic",
                "description": "Use network appliances to filter ingress or egress traffic and perform protocol-based filtering. Configure software on endpoints to filter network traffic.   Perform inline allow/denylisting of network messages based on the application layer (OSI Layer 7) protocol, especially for automation protocols. Application allowlists are beneficial when there are well-defined communication sequences, types, rates, or patterns needed during expected system operations. Application denylists may be needed if all acceptable communication sequences cannot be defined, but instead a set of known malicious uses can be denied (e.g., excessive communication  attempts, shutdown messages, invalid commands).  Devices performing these functions are often referred to as deep-packet inspection (DPI) firewalls, context-aware firewalls, or firewalls blocking specific automation/SCADA protocol aware firewalls. (Citation: Centre for the Protection of National Infrastructure February 2005)",
                "type": "course-of-action",
                "id": "M0937"
            },
            {
                "name": "Multi-factor Authentication",
                "description": "Use two or more pieces of evidence to authenticate to a system; such as username and password in addition to a token from a physical smart card or token generator.  Within industrial control environments assets such as low-level controllers, workstations, and HMIs have real-time operational control and safety requirements which may restrict the use of multi-factor.",
                "type": "course-of-action",
                "id": "M0932"
            },
            {
                "name": "Password Policies",
                "description": "Set and enforce secure password policies for accounts.",
                "type": "course-of-action",
                "id": "M0927"
            },
            {
                "name": "Application Developer Guidance",
                "description": "This mitigation describes any guidance or training given to developers of applications to avoid introducing security weaknesses that an adversary may be able to take advantage of.",
                "type": "course-of-action",
                "id": "M0913"
            },
            {
                "name": "Audit",
                "description": "Perform audits or scans of systems, permissions, insecure software, insecure configurations, etc. to identify potential weaknesses. Perform periodic integrity checks of the device to validate the correctness of the firmware, software, programs, and configurations. Integrity checks, which typically include cryptographic hashes or digital signatures, should be compared to those obtained at known valid states, especially after events like device reboots, program downloads, or program restarts.",
                "type": "course-of-action",
                "id": "M0947"
            },
            {
                "name": "Account Use Policies",
                "description": "Configure features related to account use like login attempt lockouts, specific login times, etc.",
                "type": "course-of-action",
                "id": "M0936"
            },
            {
                "name": "Active Directory Configuration",
                "description": "Configure Active Directory to prevent use of certain techniques; use security identifier (SID) Filtering, etc.",
                "type": "course-of-action",
                "id": "M0915"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": []
    },
    "detectionRequirements": {
        "requirements": []
    },
    "cspcontrolIds": [],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [],
    "technologycontrolIds": [],
    "cveIds": [
        "CVE-2020-12008"
    ],
    "subTechniques": []
}
