{
    "id": "T1021.001",
    "name": "Remote Desktop Protocol",
    "x_mitre_is_subtechnique": true,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may use [Valid Accounts](https://attack.mitre.org/techniques/T1078) to log into a computer using the Remote Desktop Protocol (RDP). The adversary may then perform actions as the logged-on user.\n\nRemote desktop is a common feature in operating systems. It allows a user to log into an interactive session with a system desktop graphical user interface on a remote system. Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote Desktop Services (RDS).(Citation: TechNet Remote Desktop Services) \n\nAdversaries may connect to a remote system over RDP/RDS to expand access if the service is enabled and allows access to accounts with known credentials. Adversaries will likely use Credential Access techniques to acquire credentials to use with RDP. Adversaries may also use RDP in conjunction with the [Accessibility Features](https://attack.mitre.org/techniques/T1546/008) or [Terminal Services DLL](https://attack.mitre.org/techniques/T1505/005) for Persistence.(Citation: Alperovitch Malware)",
    "x_mitre_platforms": [
        "Windows"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1021/001",
            "external_id": "T1021.001"
        },
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/555.html",
            "external_id": "CAPEC-555"
        },
        {
            "source_name": "TechNet Remote Desktop Services",
            "description": "Microsoft. (n.d.). Remote Desktop Services. Retrieved June 1, 2016.",
            "url": "https://technet.microsoft.com/en-us/windowsserver/ee236407.aspx"
        },
        {
            "source_name": "Alperovitch Malware",
            "description": "Alperovitch, D. (2014, October 31). Malware-Free Intrusions. Retrieved November 4, 2014.",
            "url": "http://blog.crowdstrike.com/adversary-tricks-crowdstrike-treats/"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "lateral-movement"
        }
    ],
    "tactic": [
        "lateral-movement"
    ],
    "x_mitre_detection": "Use of RDP may be legitimate, depending on the network environment and how it is used. Other factors, such as access patterns and activity that occurs after a remote login, may indicate suspicious or malicious behavior with RDP. Monitor for user accounts logged into systems they would not normally access or access patterns to multiple systems over a relatively short period of time.",
    "x_mitre_data_sources": [
        "Process: Process Creation",
        "Network Traffic: Network Traffic Flow",
        "Network Traffic: Network Connection Creation",
        "Logon Session: Logon Session Creation"
    ],
    "x_mitre_permissions_required": [
        "Remote Desktop Users",
        "User"
    ],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [
        "RDP service enabled, account in the Remote Desktop Users group"
    ],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Audit",
                "description": "Perform audits or scans of systems, permissions, insecure software, insecure configurations, etc. to identify potential weaknesses.",
                "type": "course-of-action",
                "id": "M1047"
            },
            {
                "name": "Limit Access to Resource Over Network",
                "description": "Prevent access to file shares, remote access to systems, unnecessary services. Mechanisms to limit access may include use of network concentrators, RDP gateways, etc.",
                "type": "course-of-action",
                "id": "M1035"
            },
            {
                "name": "Network Segmentation",
                "description": "Architect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. Configure separate virtual private cloud (VPC) instances to isolate critical cloud systems.",
                "type": "course-of-action",
                "id": "M1030"
            },
            {
                "name": "Operating System Configuration",
                "description": "Make configuration changes related to the operating system or a common feature of the operating system that result in system hardening against techniques.",
                "type": "course-of-action",
                "id": "M1028"
            },
            {
                "name": "Disable or Remove Feature or Program",
                "description": "Remove or deny access to unnecessary and potentially vulnerable software to prevent abuse by adversaries.",
                "type": "course-of-action",
                "id": "M1042"
            },
            {
                "name": "User Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to user accounts.",
                "type": "course-of-action",
                "id": "M1018"
            },
            {
                "name": "Multi-factor Authentication",
                "description": "Use two or more pieces of evidence to authenticate to a system; such as username and password in addition to a token from a physical smart card or token generator.",
                "type": "course-of-action",
                "id": "M1032"
            },
            {
                "name": "Privileged Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root.",
                "type": "course-of-action",
                "id": "M1026"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": [
            {
                "description": "Ensure that Remote Desktop Users group membership is audited regularly.",
                "acid": "98582239"
            },
            {
                "description": "Ensure that unnecessary accounts and groups are removed from Remote Desktop Users groups.",
                "acid": "98582240"
            },
            {
                "description": "Ensure that RDP service is disabled if not required.",
                "acid": "98582241"
            },
            {
                "description": "Ensure that remote desktop gateways are used to limit resource access.",
                "acid": "98582242"
            },
            {
                "description": "Ensure that multi-factor authentication is implemented for remote logins.",
                "acid": "98582243"
            },
            {
                "description": "Ensure that RDP access is restricted from the internet.",
                "acid": "98582244"
            },
            {
                "description": "Ensure that Firewall rules are properly configured to block RDP traffic between network security zones within a network.",
                "acid": "98582245"
            },
            {
                "description": "Ensure that GPOs settings are configured properly to minimize timeout sessions.",
                "acid": "98582246"
            },
            {
                "description": "Ensure that GPOs settings are configured properly to specify the maximum amount of time a disconnected session stays active on the RD session host server.",
                "acid": "98582247"
            },
            {
                "description": "Ensure that local Administrators group are removed from the list of groups allowed to log in through RDP.",
                "acid": "98582248"
            },
            {
                "description": "Ensure that remote user permissions are limited (if necessary) for remote user access.",
                "acid": "98582249"
            }
        ]
    },
    "detectionRequirements": {
        "requirements": [
            {
                "description": "Ensure that system is monitored for access patterns and activity after a remote login is established to detect malicious behavior related to RDP.",
                "acid": "98582237"
            },
            {
                "description": "Ensure that system is monitored for user accounts that logged into systems (not access normally to multiple systems in short period of time).",
                "acid": "98582238"
            }
        ]
    },
    "cspcontrolIds": [
        "40000097",
        "40000205",
        "40000490",
        "40000499"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [],
    "technologycontrolIds": [
        "16020466",
        "16100508",
        "16120461",
        "19920445"
    ],
    "cveIds": []
}
