{
    "id": "T1218",
    "name": "System Binary Proxy Execution",
    "x_mitre_is_subtechnique": false,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may bypass process and/or signature-based defenses by proxying execution of malicious content with signed, or otherwise trusted, binaries. Binaries used in this technique are often Microsoft-signed files, indicating that they have been either downloaded from Microsoft or are already native in the operating system.(Citation: LOLBAS Project) Binaries signed with trusted digital certificates can typically execute on Windows systems protected by digital signature validation. Several Microsoft signed binaries that are default on Windows installations can be used to proxy execution of other files or commands.\n\nSimilarly, on Linux systems adversaries may abuse trusted binaries such as <code>split</code> to proxy execution of malicious commands.(Citation: split man page)(Citation: GTFO split)",
    "x_mitre_platforms": [
        "Windows",
        "Linux",
        "macOS"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [
        "Anti-virus",
        "Application control",
        "Digital Certificate Validation"
    ],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1218",
            "external_id": "T1218"
        },
        {
            "source_name": "GTFO split",
            "description": "GTFOBins. (2020, November 13). split. Retrieved April 18, 2022.",
            "url": "https://gtfobins.github.io/gtfobins/split/"
        },
        {
            "source_name": "LOLBAS Project",
            "description": "Oddvar Moe et al. (2022, February).  Living Off The Land Binaries, Scripts and Libraries. Retrieved March 7, 2022.",
            "url": "https://github.com/LOLBAS-Project/LOLBAS#criteria"
        },
        {
            "source_name": "split man page",
            "description": "Torbjorn Granlund, Richard M. Stallman. (2020, March null). split(1) — Linux manual page. Retrieved March 25, 2022.",
            "url": "https://man7.org/linux/man-pages/man1/split.1.html"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "defense-evasion"
        }
    ],
    "tactic": [
        "defense-evasion"
    ],
    "x_mitre_detection": "Monitor processes and command-line parameters for signed binaries that may be used to proxy execution of malicious files. Compare recent invocations of signed binaries that may be used to proxy execution with prior history of known good arguments and loaded files to determine anomalous and potentially adversarial activity. Legitimate programs used in suspicious ways, like msiexec.exe downloading an MSI file from the Internet, may be indicative of an intrusion. Correlate activity with other suspicious behavior to reduce false positives that may be due to normal benign use by users and administrators.\n\nMonitor for file activity (creations, downloads, modifications, etc.), especially for file types that are not typical within an environment and may be indicative of adversary activity.",
    "x_mitre_data_sources": [
        "Process: OS API Execution",
        "Network Traffic: Network Connection Creation",
        "Windows Registry: Windows Registry Key Modification",
        "Process: Process Creation",
        "File: File Creation",
        "Module: Module Load",
        "Command: Command Execution"
    ],
    "x_mitre_permissions_required": [],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Exploit Protection",
                "description": "Use capabilities to detect and block conditions that may lead to or be indicative of a software exploit occurring.",
                "type": "course-of-action",
                "id": "M1050"
            },
            {
                "name": "Privileged Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root.",
                "type": "course-of-action",
                "id": "M1026"
            },
            {
                "name": "Execution Prevention",
                "description": "Block execution of code on a system through application control, and/or script blocking.",
                "type": "course-of-action",
                "id": "M1038"
            },
            {
                "name": "Disable or Remove Feature or Program",
                "description": "Remove or deny access to unnecessary and potentially vulnerable software to prevent abuse by adversaries.",
                "type": "course-of-action",
                "id": "M1042"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": [
            {
                "description": "Ensure that native binaries that are not necessary (and could execute other programs) are removed.",
                "acid": "98581579"
            },
            {
                "description": "Ensure that application whitelisting is implemented to prevent the execution of binaries (if not required for a system or network).",
                "acid": "98581580"
            },
            {
                "description": "Ensure that Microsoft's Enhanced Mitigation Experience Toolkit (EMET) is used to block methods of trusted binaries (to bypass application control).",
                "acid": "98581581"
            },
            {
                "description": "Ensure that Microsoft's Attack Surface Reduction (ASR) feature is used to block methods of trusted binaries (to bypass application control).",
                "acid": "98581582"
            },
            {
                "description": "Ensure that the execution of vulnerable binaries towards privileged accounts is restricted.",
                "acid": "98581583"
            },
            {
                "description": "Ensure that the execution of vulnerable binaries towards privileged groups is restricted.",
                "acid": "98581584"
            }
        ]
    },
    "detectionRequirements": {
        "requirements": [
            {
                "description": "Ensure that processes are monitored for signed binaries, that may be used to proxy execution of malicious files.",
                "acid": "98581572"
            },
            {
                "description": "Ensure that command-line parameters are monitored for signed binaries that may be used to proxy execution of malicious files.",
                "acid": "98581573"
            },
            {
                "description": "Ensure that recent calls of signed binaries are compared with a history of known good arguments to determine anomalous activity.",
                "acid": "98581574"
            },
            {
                "description": "Ensure that a recent call of signed binaries is compared with the history of loaded files to determine anomalous activity.",
                "acid": "98581575"
            },
            {
                "description": "Ensure that legitimate programs e.g. msiexec.exe is monitored for suspicious activity (e.g. downloading an MSI file).",
                "acid": "98581576"
            },
            {
                "description": "Ensure that activity is correlated with suspicious behavior to reduce false positives.",
                "acid": "98581577"
            },
            {
                "description": "Ensure that file related activity (e.g. creations, downloads, modifications, etc.) for file types are monitored.",
                "acid": "98581578"
            }
        ]
    },
    "cspcontrolIds": [
        "40000205",
        "40000208",
        "40000499"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [
        "50106008"
    ],
    "technologycontrolIds": [
        "10960079",
        "10960080"
    ],
    "cveIds": [],
    "subTechniques": [
        "T1218.001",
        "T1218.002",
        "T1218.003",
        "T1218.004",
        "T1218.005",
        "T1218.007",
        "T1218.008",
        "T1218.009",
        "T1218.010",
        "T1218.011",
        "T1218.012",
        "T1218.013",
        "T1218.014"
    ]
}
