{
    "id": "T1499.003",
    "name": "Application Exhaustion Flood",
    "x_mitre_is_subtechnique": true,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may target resource intensive features of applications to cause a denial of service (DoS), denying availability to those applications. For example, specific features in web applications may be highly resource intensive. Repeated requests to those features may be able to exhaust system resources and deny access to the application or the server itself.(Citation: Arbor AnnualDoSreport Jan 2018)",
    "x_mitre_platforms": [
        "Windows",
        "Azure AD",
        "Office 365",
        "SaaS",
        "IaaS",
        "Linux",
        "macOS",
        "Google Workspace"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1499/003",
            "external_id": "T1499.003"
        },
        {
            "source_name": "Arbor AnnualDoSreport Jan 2018",
            "description": "Philippe Alcoy, Steinthor Bjarnason, Paul Bowen, C.F. Chui, Kirill Kasavchnko, and Gary Sockrider of Netscout Arbor. (2018, January). Insight into the Global Threat Landscape - Netscout Arbor's 13th Annual Worldwide Infrastructure Security Report. Retrieved April 22, 2019.",
            "url": "https://pages.arbornetworks.com/rs/082-KNA-087/images/13th_Worldwide_Infrastructure_Security_Report.pdf"
        },
        {
            "source_name": "Cisco DoSdetectNetflow",
            "description": "Cisco. (n.d.). Detecting and Analyzing Network Threats With NetFlow. Retrieved April 25, 2019.",
            "url": "https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/netflow/configuration/15-mt/nf-15-mt-book/nf-detct-analy-thrts.pdf"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "impact"
        }
    ],
    "tactic": [
        "impact"
    ],
    "x_mitre_detection": "Detection of Endpoint DoS can sometimes be achieved before the effect is sufficient to cause significant impact to the availability of the service, but such response time typically requires very aggressive monitoring and responsiveness. Typical network throughput monitoring tools such as netflow, SNMP, and custom scripts can be used to detect sudden increases in circuit utilization.(Citation: Cisco DoSdetectNetflow) Real-time, automated, and qualitative study of the network traffic can identify a sudden surge in one type of protocol can be used to detect an attack as it starts.\n\nIn addition to network level detections, endpoint logging and instrumentation can be useful for detection. Attacks targeting web applications may generate logs in the web server, application server, and/or database server that can be used to identify the type of attack, possibly before the impact is felt.",
    "x_mitre_data_sources": [
        "Network Traffic: Network Traffic Content",
        "Sensor Health: Host Status",
        "Network Traffic: Network Traffic Flow",
        "Application Log: Application Log Content"
    ],
    "x_mitre_permissions_required": [],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Filter Network Traffic",
                "description": "Use network appliances to filter ingress or egress traffic and perform protocol-based filtering. Configure software on endpoints to filter network traffic.",
                "type": "course-of-action",
                "id": "M1037"
            },
            {
                "name": "Endpoint Denial of Service Mitigation",
                "description": "Leverage services provided by Content Delivery Networks (CDN) or providers specializing in DoS mitigations to filter traffic upstream from services.(Citation: CERT-EU DDoS March 2017) Filter boundary traffic by blocking source addresses sourcing the attack, blocking ports that are being targeted, or blocking protocols being used for transport. To defend against SYN floods, enable SYN Cookies.",
                "type": "course-of-action",
                "id": "T1499"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": [
            {
                "description": "Ensure that services provided by Content Delivery Networks (CDN) or providers specializing in DoS mitigations to filter traffic upstream from services are followed.",
                "acid": "98582869"
            },
            {
                "description": "Ensure that network devices are configured to filter network traffic by blocking the source address of the attack.",
                "acid": "98582870"
            },
            {
                "description": "Ensure that network device are configured to block ports that are being targeted in the attack.",
                "acid": "98582871"
            },
            {
                "description": "Ensure that network device are configured to block protocols being used for transport.",
                "acid": "98582872"
            },
            {
                "description": "Ensure that SYN Cookies are enabled to prevent SYN floods attack.",
                "acid": "98582873"
            }
        ]
    },
    "detectionRequirements": {
        "requirements": [
            {
                "description": "Ensure that the Monitoring tool is configured (with aggressive response time) to detect Endpoint DoS.",
                "acid": "98582860"
            },
            {
                "description": "Ensure that monitoring tool e.g. netflow, SNMP, and custom scripts are used to analyze network traffic to detect sudden spikes in the network.",
                "acid": "98582861"
            },
            {
                "description": "Ensure that real-time, automated, and qualitative study of network traffic is analyzed to identify a sudden surge in one type of protocol (can be used to detect an attack in the initial stage).",
                "acid": "98582862"
            },
            {
                "description": "Ensure that Intrusion Detection System is implemented in the organization to detect malicious network traffic.",
                "acid": "98582863"
            },
            {
                "description": "Ensure that endpoint logging and instrumentation are monitored.",
                "acid": "98582864"
            },
            {
                "description": "Ensure that Logging and Monitoring solutions are configured to monitor web server logs (generated when targeting web application) to detect web application attacks.",
                "acid": "98582865"
            },
            {
                "description": "Ensure that Logging and Monitoring solutions are configured to monitor application server logs to (generated when targeting web application) detect web application attack.",
                "acid": "98582866"
            },
            {
                "description": "Ensure that Logging and Monitoring solutions are configured to monitor database server logs (generated when targeting web application) to detect web application attacks.",
                "acid": "98582867"
            },
            {
                "description": "Ensure that Endpoint services are monitored externally to detect Endpoint DoS.",
                "acid": "98582868"
            }
        ]
    },
    "cspcontrolIds": [
        "40000182"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [],
    "technologycontrolIds": [
        "101540004",
        "101540010",
        "101540016",
        "101540039",
        "101540040",
        "101550004",
        "101550010",
        "101550016",
        "101550040",
        "101550041",
        "101560004",
        "101560010",
        "101560011",
        "101560015",
        "101560016",
        "101570004",
        "101570010",
        "101570011",
        "101570015",
        "101570016",
        "101600004",
        "101600010",
        "101600011",
        "101600015",
        "101600016",
        "103900004",
        "103900010",
        "103900011",
        "103900015",
        "103900016",
        "10460004",
        "10460015",
        "10460016",
        "10960031",
        "10960040",
        "10960059",
        "11010004",
        "11010015",
        "11010016",
        "11060037",
        "11060039",
        "11100036",
        "11100037",
        "11100038",
        "14030022",
        "14030043",
        "14030075",
        "14030076",
        "14030077",
        "14030087",
        "14030088",
        "14030093",
        "14030096",
        "14040022",
        "14040043",
        "14040078",
        "14040088",
        "16390020",
        "18360001",
        "18370008",
        "18410005",
        "18410006",
        "18910002",
        "19440005"
    ],
    "cveIds": [
        "CVE-2017-16115"
    ]
}
