{
    "id": "T1498.001",
    "name": "Direct Network Flood",
    "x_mitre_is_subtechnique": true,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may attempt to cause a denial of service (DoS) by directly sending a high-volume of network traffic to a target. This DoS attack may also reduce the availability and functionality of the targeted system(s) and network. [Direct Network Flood](https://attack.mitre.org/techniques/T1498/001)s are when one or more systems are used to send a high-volume of network packets towards the targeted service's network. Almost any network protocol may be used for flooding. Stateless protocols such as UDP or ICMP are commonly used but stateful protocols such as TCP can be used as well.\n\nBotnets are commonly used to conduct network flooding attacks against networks and services. Large botnets can generate a significant amount of traffic from systems spread across the global Internet. Adversaries may have the resources to build out and control their own botnet infrastructure or may rent time on an existing botnet to conduct an attack. In some of the worst cases for distributed DoS (DDoS), so many systems are used to generate the flood that each one only needs to send out a small amount of traffic to produce enough volume to saturate the target network. In such circumstances, distinguishing DDoS traffic from legitimate clients becomes exceedingly difficult. Botnets have been used in some of the most high-profile DDoS flooding attacks, such as the 2012 series of incidents that targeted major US banks.(Citation: USNYAG IranianBotnet March 2016)",
    "x_mitre_platforms": [
        "Windows",
        "Azure AD",
        "Office 365",
        "SaaS",
        "IaaS",
        "Linux",
        "macOS",
        "Google Workspace"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1498/001",
            "external_id": "T1498.001"
        },
        {
            "source_name": "Cisco DoSdetectNetflow",
            "description": "Cisco. (n.d.). Detecting and Analyzing Network Threats With NetFlow. Retrieved April 25, 2019.",
            "url": "https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/netflow/configuration/15-mt/nf-15-mt-book/nf-detct-analy-thrts.pdf"
        },
        {
            "source_name": "USNYAG IranianBotnet March 2016",
            "description": "Preet Bharara, US Attorney. (2016, March 24). Retrieved April 23, 2019.",
            "url": "https://www.justice.gov/opa/pr/seven-iranians-working-islamic-revolutionary-guard-corps-affiliated-entities-charged"
        },
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/125.html",
            "external_id": "CAPEC-125"
        },
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/486.html",
            "external_id": "CAPEC-486"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "impact"
        }
    ],
    "tactic": [
        "impact"
    ],
    "x_mitre_detection": "Detection of a network flood can sometimes be achieved before the traffic volume is sufficient to cause impact to the availability of the service, but such response time typically requires very aggressive monitoring and responsiveness or services provided by an upstream network service provider. Typical network throughput monitoring tools such as netflow(Citation: Cisco DoSdetectNetflow), SNMP, and custom scripts can be used to detect sudden increases in network or service utilization. Real-time, automated, and qualitative study of the network traffic can identify a sudden surge in one type of protocol can be used to detect a network flood event as it starts. Often, the lead time may be small and the indicator of an event availability of the network or service drops. The analysis tools mentioned can then be used to determine the type of DoS causing the outage and help with remediation.",
    "x_mitre_data_sources": [
        "Sensor Health: Host Status",
        "Network Traffic: Network Traffic Flow"
    ],
    "x_mitre_permissions_required": [],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Filter Network Traffic",
                "description": "Use network appliances to filter ingress or egress traffic and perform protocol-based filtering. Configure software on endpoints to filter network traffic.",
                "type": "course-of-action",
                "id": "M1037"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": [
            {
                "description": "Ensure that upstream incoming traffic is blocked (when flood volumes exceed the capacity of the targeted network connection) to filter out the attack traffic from the legitimate traffic.",
                "acid": "98582912"
            },
            {
                "description": "Ensure that hosting Internet Service Provider (ISP) or Content Delivery Network (CDN) or providers intercept the incoming traffic upstream to filter out the attack traffic from the legitimate traffic.",
                "acid": "98582913"
            },
            {
                "description": "Ensure that on-premises filtering is implemented by blocking source addresses sourcing the attack.",
                "acid": "98582914"
            },
            {
                "description": "Ensure that on-premises filtering is implemented by blocking ports that are being targeted in the attack.",
                "acid": "98582915"
            },
            {
                "description": "Ensure that on-premises filtering is implemented by blocking protocols being used for transport.",
                "acid": "98582916"
            },
            {
                "description": "Ensure that 3rd parties are hired to analyze the risk associated with critical resources (affected by Network DoS attacks).",
                "acid": "98582917"
            },
            {
                "description": "Ensure that a disaster recovery plan/business continuity plan is implemented to take immediate action to incidents (e.g. Network DoS attacks).",
                "acid": "98582918"
            }
        ]
    },
    "detectionRequirements": {
        "requirements": [
            {
                "description": "Ensure that the monitoring tool is configured (with aggressive response time) to detect Network DoS.",
                "acid": "98582909"
            },
            {
                "description": "Ensure that monitoring tools e.g. netflow, SNMP, and custom scripts are used to detect sudden increases in-network or service utilization.",
                "acid": "98582910"
            },
            {
                "description": "Ensure that real-time, automated, and qualitative study of network traffic is analyzed to identify a sudden surge in one type of protocol (can be used to detect Network DoS in the initial stage).",
                "acid": "98582911"
            }
        ]
    },
    "cspcontrolIds": [
        "40000020",
        "40000513",
        "40000523"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [],
    "technologycontrolIds": [
        "101540010",
        "101540016",
        "101540039",
        "101540040",
        "101550010",
        "101550016",
        "101550040",
        "101550041",
        "101560010",
        "101560011",
        "101560015",
        "101560016",
        "101570010",
        "101570011",
        "101570015",
        "101570016",
        "101600010",
        "101600011",
        "101600015",
        "101600016",
        "10190022",
        "103900010",
        "103900011",
        "103900015",
        "103900016",
        "10460015",
        "10460016",
        "11010015",
        "11010016",
        "14030021",
        "14040021",
        "16390020",
        "19010022",
        "19920479",
        "19920482"
    ],
    "cveIds": []
}
