{
    "id": "T1556.001",
    "name": "Domain Controller Authentication",
    "x_mitre_is_subtechnique": true,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may patch the authentication process on a domain controller to bypass the typical authentication mechanisms and enable access to accounts. \n\nMalware may be used to inject false credentials into the authentication process on a domain controller with the intent of creating a backdoor used to access any user's account and/or credentials (ex: [Skeleton Key](https://attack.mitre.org/software/S0007)). Skeleton key works through a patch on an enterprise domain controller authentication process (LSASS) with credentials that adversaries may use to bypass the standard authentication system. Once patched, an adversary can use the injected password to successfully authenticate as any domain user account (until the the skeleton key is erased from memory by a reboot of the domain controller). Authenticated access may enable unfettered access to hosts and/or resources within single-factor authentication environments.(Citation: Dell Skeleton)",
    "x_mitre_platforms": [
        "Windows"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1556/001",
            "external_id": "T1556.001"
        },
        {
            "source_name": "Dell Skeleton",
            "description": "Dell SecureWorks. (2015, January 12). Skeleton Key Malware Analysis. Retrieved April 8, 2019.",
            "url": "https://www.secureworks.com/research/skeleton-key-malware-analysis"
        },
        {
            "source_name": "TechNet Audit Policy",
            "description": "Microsoft. (2016, April 15). Audit Policy Recommendations. Retrieved June 3, 2016.",
            "url": "https://technet.microsoft.com/en-us/library/dn487457.aspx"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "credential-access"
        },
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "defense-evasion"
        },
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "persistence"
        }
    ],
    "tactic": [
        "credential-access",
        "defense-evasion",
        "persistence"
    ],
    "x_mitre_detection": "Monitor for calls to <code>OpenProcess</code> that can be used to manipulate lsass.exe running on a domain controller as well as for malicious modifications to functions exported from authentication-related system DLLs (such as cryptdll.dll and samsrv.dll).(Citation: Dell Skeleton)\n\nConfigure robust, consistent account activity audit policies across the enterprise and with externally accessible services.(Citation: TechNet Audit Policy) Look for suspicious account behavior across systems that share accounts, either user, admin, or service accounts. Examples: one account logged into multiple systems simultaneously; multiple accounts logged into the same machine simultaneously; accounts logged in at odd times or outside of business hours. Activity may be from interactive login sessions or process ownership from accounts being used to execute binaries on a remote system as a particular account. Correlate other security systems with login information (e.g. a user has an active login session but has not entered the building or does not have VPN access). ",
    "x_mitre_data_sources": [
        "File: File Modification",
        "Process: Process Access",
        "Logon Session: Logon Session Creation",
        "Process: OS API Execution"
    ],
    "x_mitre_permissions_required": [
        "Administrator"
    ],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Privileged Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root.",
                "type": "course-of-action",
                "id": "M1026"
            },
            {
                "name": "Privileged Process Integrity",
                "description": "Protect processes with high privileges that can be used to interact with critical system components through use of protected process light, anti-process injection defenses, or other process integrity enforcement measures.",
                "type": "course-of-action",
                "id": "M1025"
            },
            {
                "name": "Multi-factor Authentication",
                "description": "Use two or more pieces of evidence to authenticate to a system; such as username and password in addition to a token from a physical smart card or token generator.",
                "type": "course-of-action",
                "id": "M1032"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": [
            {
                "description": "Ensure that multi-factor authentication (MFA) is configured in the organization to secure user accounts",
                "acid": "98581436"
            },
            {
                "description": "Ensure that multi-factor authentication (MFA) is configured to restrict access to cloud resources and APIs",
                "acid": "98581437"
            },
            {
                "description": "Ensure that the Privilege access (account) management (PAM) solution is configured to audit domain and local accounts",
                "acid": "98581438"
            },
            {
                "description": "Ensure that the Privilege access management (PAM) policy is defined as per best practice standards",
                "acid": "98581439"
            },
            {
                "description": "Ensure that LSA protection is configured to be enabled by Protected Process Light (PPL) feature",
                "acid": "98581440"
            }
        ]
    },
    "detectionRequirements": {
        "requirements": [
            {
                "description": "Ensure that the lsass.exe process running on the domain controller is monitored for calls to OpenProcess. (cryptdll.dll &samsrv.dll)",
                "acid": "98581434"
            },
            {
                "description": "Ensure that User account management (policy and tools) are defined as monitoring simultaneous multiple logins of the same user accounts",
                "acid": "98581435"
            }
        ]
    },
    "cspcontrolIds": [
        "40000205",
        "40000499"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [
        "50100281",
        "50100285"
    ],
    "technologycontrolIds": [],
    "cveIds": []
}
