{
    "id": "T1601",
    "name": "Modify System Image",
    "x_mitre_is_subtechnique": false,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may make changes to the operating system of embedded network devices to weaken defenses and provide new capabilities for themselves.  On such devices, the operating systems are typically monolithic and most of the device functionality and capabilities are contained within a single file.\n\nTo change the operating system, the adversary typically only needs to affect this one file, replacing or modifying it.  This can either be done live in memory during system runtime for immediate effect, or in storage to implement the change on the next boot of the network device.",
    "x_mitre_platforms": [
        "Network"
    ],
    "x_mitre_domains": [
        "enterprise-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "url": "https://attack.mitre.org/techniques/T1601",
            "external_id": "T1601"
        },
        {
            "source_name": "Cisco IOS Software Integrity Assurance - Image File Verification",
            "description": "Cisco. (n.d.). Cisco IOS Software Integrity Assurance - Cisco IOS Image File Verification. Retrieved October 19, 2020.",
            "url": "https://tools.cisco.com/security/center/resources/integrity_assurance.html#7"
        },
        {
            "source_name": "Cisco IOS Software Integrity Assurance - Run-Time Memory Verification",
            "description": "Cisco. (n.d.). Cisco IOS Software Integrity Assurance - Cisco IOS Run-Time Memory Integrity Verification. Retrieved October 19, 2020.",
            "url": "https://tools.cisco.com/security/center/resources/integrity_assurance.html#13"
        }
    ],
    "kill_chain_phases": [
        {
            "kill_chain_name": "mitre-attack",
            "phase_name": "defense-evasion"
        }
    ],
    "tactic": [
        "defense-evasion"
    ],
    "x_mitre_detection": "Most embedded network devices provide a command to print the version of the currently running operating system.  Use this command to query the operating system for its version number and compare it to what is expected for the device in question.  Because this method may be used in conjunction with [Patch System Image](https://attack.mitre.org/techniques/T1601/001), it may be appropriate to also verify the integrity of the vendor provided operating system image file. \n\nCompare the checksum of the operating system file with the checksum of a known good copy from a trusted source.  Some embedded network device platforms may have the capability to calculate the checksum of the file, while others may not.  Even for those platforms that have the capability, it is recommended to download a copy of the file to a trusted computer to calculate the checksum with software that is not compromised.  (Citation: Cisco IOS Software Integrity Assurance - Image File Verification)\n\nMany vendors of embedded network devices can provide advanced debugging support that will allow them to work with device owners to validate the integrity of the operating system running in memory.  If a compromise of the operating system is suspected, contact the vendor technical support and seek such services for a more thorough inspection of the current running system.  (Citation: Cisco IOS Software Integrity Assurance - Run-Time Memory Verification)",
    "x_mitre_data_sources": [
        "File: File Modification"
    ],
    "x_mitre_permissions_required": [
        "Administrator"
    ],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Multi-factor Authentication",
                "description": "Use two or more pieces of evidence to authenticate to a system; such as username and password in addition to a token from a physical smart card or token generator.",
                "type": "course-of-action",
                "id": "M1032"
            },
            {
                "name": "Password Policies",
                "description": "Set and enforce secure password policies for accounts.",
                "type": "course-of-action",
                "id": "M1027"
            },
            {
                "name": "Credential Access Protection",
                "description": "Use capabilities to prevent successful credential access by adversaries; including blocking forms of credential dumping.",
                "type": "course-of-action",
                "id": "M1043"
            },
            {
                "name": "Code Signing",
                "description": "Enforce binary and application integrity with digital signature verification to prevent untrusted code from executing.",
                "type": "course-of-action",
                "id": "M1045"
            },
            {
                "name": "Boot Integrity",
                "description": "Use secure methods to boot a system and verify the integrity of the operating system and loading mechanisms.",
                "type": "course-of-action",
                "id": "M1046"
            },
            {
                "name": "Privileged Account Management",
                "description": "Manage the creation, modification, use, and permissions associated to privileged accounts, including SYSTEM and root.",
                "type": "course-of-action",
                "id": "M1026"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": []
    },
    "detectionRequirements": {
        "requirements": []
    },
    "cspcontrolIds": [
        "40000162",
        "40000205",
        "40000496",
        "40000499"
    ],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [
        "50106027",
        "50106115"
    ],
    "technologycontrolIds": [],
    "cveIds": [],
    "subTechniques": [
        "T1601.001",
        "T1601.002"
    ]
}
