{
    "id": "T1629",
    "name": "Impair Defenses",
    "x_mitre_is_subtechnique": false,
    "revoked": false,
    "x_mitre_deprecated": false,
    "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may span both native defenses as well as supplemental capabilities installed by users or mobile endpoint administrators.",
    "x_mitre_platforms": [
        "Android"
    ],
    "x_mitre_domains": [
        "mobile-attack"
    ],
    "x_mitre_defense_bypassed": [],
    "external_references": [
        {
            "source_name": "mitre-attack",
            "external_id": "T1629",
            "url": "https://attack.mitre.org/techniques/T1629"
        },
        {
            "source_name": "Samsung Knox Mobile Threat Defense",
            "url": "https://partner.samsungknox.com/mtd",
            "description": "Samsung Knox Partner Program. (n.d.). Knox for Mobile Threat Defense. Retrieved March 30, 2022."
        },
        {
            "url": "https://pages.nist.gov/mobile-threat-catalogue/application-threats/APP-22.html",
            "source_name": "NIST Mobile Threat Catalogue",
            "external_id": "APP-22"
        }
    ],
    "kill_chain_phases": [
        {
            "phase_name": "defense-evasion",
            "kill_chain_name": "mitre-mobile-attack"
        }
    ],
    "tactic": [
        "defense-evasion"
    ],
    "x_mitre_detection": "Mobile security products integrated with Samsung Knox for Mobile Threat Defense can monitor processes to see if security tools are killed or stop running. Application vetting can detect many techniques associated with impairing device defenses.(Citation: Samsung Knox Mobile Threat Defense)",
    "x_mitre_data_sources": [],
    "x_mitre_permissions_required": [],
    "x_mitre_effective_permissions": [],
    "x_mitre_system_requirements": [],
    "x_mitre_remote_support": false,
    "relation": {
        "mitigates": [
            {
                "name": "Deploy Compromised Device Detection Method",
                "description": "A variety of methods exist that can be used to enable enterprises to identify compromised (e.g. rooted/jailbroken) devices, whether using security mechanisms built directly into the device, third-party mobile security applications, enterprise mobility management (EMM)/mobile device management (MDM) capabilities, or other methods. Some methods may be trivial to evade while others may be more sophisticated.",
                "type": "course-of-action",
                "id": "M1010"
            },
            {
                "name": "Security Updates",
                "description": "Install security updates in response to discovered vulnerabilities.\n\nPurchase devices with a vendor and/or mobile carrier commitment to provide security updates in a prompt manner for a set period of time.\n\nDecommission devices that will no longer receive security updates.\n\nLimit or block access to enterprise resources from devices that have not installed recent security updates.\n\nOn Android devices, access can be controlled based on each device's security patch level. On iOS devices, access can be controlled based on the iOS version.",
                "type": "course-of-action",
                "id": "M1001"
            },
            {
                "name": "User Guidance",
                "description": "Describes any guidance or training given to users to set particular configuration settings or avoid specific potentially risky behaviors.",
                "type": "course-of-action",
                "id": "M1011"
            },
            {
                "name": "System Partition Integrity",
                "description": "Ensure that Android devices being used include and enable the Verified Boot capability, which cryptographically ensures the integrity of the system partition.",
                "type": "course-of-action",
                "id": "M1004"
            },
            {
                "name": "Enterprise Policy",
                "description": "An enterprise mobility management (EMM), also known as mobile device management (MDM), system can be used to provision policies to mobile devices to control aspects of their allowed behavior.",
                "type": "course-of-action",
                "id": "M1012"
            }
        ]
    },
    "mitigationRequirements": {
        "requirements": []
    },
    "detectionRequirements": {
        "requirements": []
    },
    "cspcontrolIds": [],
    "externalcontrolIds": [],
    "peoplecontrolIds": [],
    "policycontrolIds": [],
    "technologycontrolIds": [],
    "cveIds": [],
    "subTechniques": [
        "T1629.001",
        "T1629.002",
        "T1629.003"
    ]
}
